#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PartySuggestion

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.ExecuteUbergraph_Athena_PartySuggestion
// 0x02E0 (0x02E0 - 0x0000)
struct Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable123;                             // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable1234;                            // 0x0070(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable123;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1234;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable12345;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortSocialItem*>                CallFunc_Map_Values_Values;                        // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortSocialItem*                        CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable12;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x00DC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x00EC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable123;                             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable123456;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1234567;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPartySuggestion                   K2Node_CustomEvent_Party_Suggestion_Struct;        // 0x0110(0x0078)()
	struct FFortPartySuggestion                   K2Node_CustomEvent_PartySuggestionStruct;          // 0x0188(0x0078)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0220(0x0008)(NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1234;                            // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select12_Default;                           // 0x0238(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0250(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A0(0x0018)()
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DateTimeDateTime_ReturnValue;    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select123_Default;                          // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1234_Default;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select12345_Default;                        // 0x02CC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion) == 0x000008, "Wrong alignment on Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion");
static_assert(sizeof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion) == 0x0002E0, "Wrong size on Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, EntryPoint) == 0x000000, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable) == 0x000004, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable1) == 0x000008, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable12) == 0x00000C, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable12' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_text_Variable) == 0x000010, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_text_Variable1) == 0x000028, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_text_Variable12) == 0x000040, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_text_Variable12' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_text_Variable123) == 0x000058, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_text_Variable123' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_text_Variable1234) == 0x000070, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_text_Variable1234' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_bool_Variable) == 0x000088, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable123) == 0x00008C, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable123' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable1234) == 0x000090, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable1234' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_bool_Variable1) == 0x000094, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable12345) == 0x000098, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable12345' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_Map_Values_Values) == 0x0000A0, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_Map_Length_ReturnValue) == 0x0000B8, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_GetDisplayName_ReturnValue) == 0x0000C0, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_bool_Variable12) == 0x0000D8, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_bool_Variable12' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_struct_Variable) == 0x0000DC, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_struct_Variable1) == 0x0000EC, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_bool_Variable123) == 0x0000FC, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_bool_Variable123' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable123456) == 0x000100, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable123456' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_int_Variable1234567) == 0x000104, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_int_Variable1234567' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_RandomBool_ReturnValue) == 0x000108, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_CustomEvent_Party_Suggestion_Struct) == 0x000110, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_CustomEvent_Party_Suggestion_Struct' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_CustomEvent_PartySuggestionStruct) == 0x000188, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_CustomEvent_PartySuggestionStruct' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_Greater_IntInt_ReturnValue) == 0x000200, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Event_IsDesignTime) == 0x000201, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select_Default) == 0x000204, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_GetEndTime_ReturnValue) == 0x000208, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_CreateDelegate_OutputDelegate) == 0x000210, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000220, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000228, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, Temp_bool_Variable1234) == 0x000229, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::Temp_bool_Variable1234' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select1_Default) == 0x00022C, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000230, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select12_Default) == 0x000238, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select12_Default' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_MakeStruct_FormatArgumentData) == 0x000250, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_MakeArray_Array) == 0x000290, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_Format_ReturnValue) == 0x0002A0, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_DateTimeMinValue_ReturnValue) == 0x0002B8, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, CallFunc_NotEqual_DateTimeDateTime_ReturnValue) == 0x0002C0, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::CallFunc_NotEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select123_Default) == 0x0002C4, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select123_Default' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select1234_Default) == 0x0002C8, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select1234_Default' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion, K2Node_Select12345_Default) == 0x0002CC, "Member 'Athena_PartySuggestion_C_ExecuteUbergraph_Athena_PartySuggestion::K2Node_Select12345_Default' has a wrong offset!");

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Athena_PartySuggestion_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_PartySuggestion_C_PreConstruct) == 0x000001, "Wrong alignment on Athena_PartySuggestion_C_PreConstruct");
static_assert(sizeof(Athena_PartySuggestion_C_PreConstruct) == 0x000001, "Wrong size on Athena_PartySuggestion_C_PreConstruct");
static_assert(offsetof(Athena_PartySuggestion_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Athena_PartySuggestion_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.InitNewPartySuggestion
// 0x0078 (0x0078 - 0x0000)
struct Athena_PartySuggestion_C_InitNewPartySuggestion final
{
public:
	struct FFortPartySuggestion                   NewPartySuggestion;                                // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_PartySuggestion_C_InitNewPartySuggestion) == 0x000008, "Wrong alignment on Athena_PartySuggestion_C_InitNewPartySuggestion");
static_assert(sizeof(Athena_PartySuggestion_C_InitNewPartySuggestion) == 0x000078, "Wrong size on Athena_PartySuggestion_C_InitNewPartySuggestion");
static_assert(offsetof(Athena_PartySuggestion_C_InitNewPartySuggestion, NewPartySuggestion) == 0x000000, "Member 'Athena_PartySuggestion_C_InitNewPartySuggestion::NewPartySuggestion' has a wrong offset!");

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.NewPartySuggestion
// 0x0078 (0x0078 - 0x0000)
struct Athena_PartySuggestion_C_NewPartySuggestion final
{
public:
	struct FFortPartySuggestion                   Party_Suggestion_Struct;                           // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_PartySuggestion_C_NewPartySuggestion) == 0x000008, "Wrong alignment on Athena_PartySuggestion_C_NewPartySuggestion");
static_assert(sizeof(Athena_PartySuggestion_C_NewPartySuggestion) == 0x000078, "Wrong size on Athena_PartySuggestion_C_NewPartySuggestion");
static_assert(offsetof(Athena_PartySuggestion_C_NewPartySuggestion, Party_Suggestion_Struct) == 0x000000, "Member 'Athena_PartySuggestion_C_NewPartySuggestion::Party_Suggestion_Struct' has a wrong offset!");

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.OnMouseButtonDown_0
// 0x0210 (0x0210 - 0x0000)
struct Athena_PartySuggestion_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00B8)()
};
static_assert(alignof(Athena_PartySuggestion_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on Athena_PartySuggestion_C_OnMouseButtonDown_0");
static_assert(sizeof(Athena_PartySuggestion_C_OnMouseButtonDown_0) == 0x000210, "Wrong size on Athena_PartySuggestion_C_OnMouseButtonDown_0");
static_assert(offsetof(Athena_PartySuggestion_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'Athena_PartySuggestion_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'Athena_PartySuggestion_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_OnMouseButtonDown_0, ReturnValue) == 0x0000A0, "Member 'Athena_PartySuggestion_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PartySuggestion_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'Athena_PartySuggestion_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function Athena_PartySuggestion.Athena_PartySuggestion_C.UpdatePartySuggestion
// 0x0078 (0x0078 - 0x0000)
struct Athena_PartySuggestion_C_UpdatePartySuggestion final
{
public:
	struct FFortPartySuggestion                   PartySuggestionStruct;                             // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Athena_PartySuggestion_C_UpdatePartySuggestion) == 0x000008, "Wrong alignment on Athena_PartySuggestion_C_UpdatePartySuggestion");
static_assert(sizeof(Athena_PartySuggestion_C_UpdatePartySuggestion) == 0x000078, "Wrong size on Athena_PartySuggestion_C_UpdatePartySuggestion");
static_assert(offsetof(Athena_PartySuggestion_C_UpdatePartySuggestion, PartySuggestionStruct) == 0x000000, "Member 'Athena_PartySuggestion_C_UpdatePartySuggestion::PartySuggestionStruct' has a wrong offset!");

}

