#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengesTab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaChallengesTab.AthenaChallengesTab_C.ExecuteUbergraph_AthenaChallengesTab
// 0x0040 (0x0040 - 0x0000)
struct AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab");
static_assert(sizeof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab) == 0x000040, "Wrong size on AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, EntryPoint) == 0x000000, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_ComponentBoundEvent_TabId1) == 0x000010, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_ComponentBoundEvent_TabId1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_ComponentBoundEvent_TabId) == 0x000018, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_ComponentBoundEvent_TabButton) == 0x000020, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetContext_ReturnValue1) == 0x000038, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetContext_ReturnValue1' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature");
static_assert(offsetof(AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'AthenaChallengesTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.RegisterEventListeners
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaChallengesTab_C_RegisterEventListeners final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaChallengesTab_C_RegisterEventListeners) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_RegisterEventListeners");
static_assert(sizeof(AthenaChallengesTab_C_RegisterEventListeners) == 0x000010, "Wrong size on AthenaChallengesTab_C_RegisterEventListeners");
static_assert(offsetof(AthenaChallengesTab_C_RegisterEventListeners, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaChallengesTab_C_RegisterEventListeners::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.UpdateChallengeViews
// 0x0098 (0x0098 - 0x0000)
struct AthenaChallengesTab_C_UpdateChallengeViews final
{
public:
	TArray<class UFortChallengeBundleScheduleItem*> Schedules;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortChallengeBundleScheduleItem*> CallFunc_GetChallengeBundleSchedules_OutActiveBundles; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortChallengeBundleScheduleDefinition*> CallFunc_GetChallengeBundleSchedules_OutUnlockableBundles; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortChallengeBundleScheduleDefinition* CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleScheduleItem*       CallFunc_Array_Get_Item1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChallengeBundleScheduleDisplay_C*      CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleScheduleDefinition* CallFunc_GetScheduleDefinitionBP_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChallengeBundleScheduleDisplay_C*      CallFunc_Create_ReturnValue1;                      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_UpdateChallengeViews) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_UpdateChallengeViews");
static_assert(sizeof(AthenaChallengesTab_C_UpdateChallengeViews) == 0x000098, "Wrong size on AthenaChallengesTab_C_UpdateChallengeViews");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, Schedules) == 0x000000, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::Schedules' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetChallengeBundleSchedules_OutActiveBundles) == 0x000020, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetChallengeBundleSchedules_OutActiveBundles' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetChallengeBundleSchedules_OutUnlockableBundles) == 0x000030, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetChallengeBundleSchedules_OutUnlockableBundles' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, Temp_int_Array_Index_Variable1) == 0x000040, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Array_Get_Item1) == 0x000060, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Create_ReturnValue) == 0x000068, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetScheduleDefinitionBP_ReturnValue) == 0x000070, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetScheduleDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Array_Length_ReturnValue1) == 0x000078, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, Temp_int_Loop_Counter_Variable1) == 0x00007C, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Less_IntInt_ReturnValue1) == 0x000081, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Add_IntInt_ReturnValue1) == 0x000084, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetOwningPlayer_ReturnValue1) == 0x000088, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetOwningPlayer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_Create_ReturnValue1) == 0x000090, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_Create_ReturnValue1' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.CreateTab
// 0x00E0 (0x00E0 - 0x0000)
struct AthenaChallengesTab_C_CreateTab final
{
public:
	class UFortChallengeBundleScheduleDefinition* ScheduleDefinition;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ContentWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0018)()
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortTabButtonLabelInfo                K2Node_MakeStruct_FortTabButtonLabelInfo;          // 0x0038(0x0090)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterFortTab_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_CreateTab) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_CreateTab");
static_assert(sizeof(AthenaChallengesTab_C_CreateTab) == 0x0000E0, "Wrong size on AthenaChallengesTab_C_CreateTab");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, ScheduleDefinition) == 0x000000, "Member 'AthenaChallengesTab_C_CreateTab::ScheduleDefinition' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, ContentWidget) == 0x000008, "Member 'AthenaChallengesTab_C_CreateTab::ContentWidget' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'AthenaChallengesTab_C_CreateTab::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, CallFunc_GetPersistentName_ReturnValue) == 0x000028, "Member 'AthenaChallengesTab_C_CreateTab::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, K2Node_MakeStruct_FortTabButtonLabelInfo) == 0x000038, "Member 'AthenaChallengesTab_C_CreateTab::K2Node_MakeStruct_FortTabButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C8, "Member 'AthenaChallengesTab_C_CreateTab::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, CallFunc_RegisterFortTab_ReturnValue) == 0x0000D0, "Member 'AthenaChallengesTab_C_CreateTab::CallFunc_RegisterFortTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_CreateTab, CallFunc_AddChild_ReturnValue) == 0x0000D8, "Member 'AthenaChallengesTab_C_CreateTab::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.HandleTabSelected
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaChallengesTab_C_HandleTabSelected final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_HandleTabSelected) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_HandleTabSelected");
static_assert(sizeof(AthenaChallengesTab_C_HandleTabSelected) == 0x000010, "Wrong size on AthenaChallengesTab_C_HandleTabSelected");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabSelected, TabId) == 0x000000, "Member 'AthenaChallengesTab_C_HandleTabSelected::TabId' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabSelected, CallFunc_GetActiveTab_ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_HandleTabSelected::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.HandleTabButtonCreated
// 0x0048 (0x0048 - 0x0000)
struct AthenaChallengesTab_C_HandleTabButtonCreated final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          LocalTab;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalTabId;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(AthenaChallengesTab_C_HandleTabButtonCreated) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_HandleTabButtonCreated");
static_assert(sizeof(AthenaChallengesTab_C_HandleTabButtonCreated) == 0x000048, "Wrong size on AthenaChallengesTab_C_HandleTabButtonCreated");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, TabId) == 0x000000, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::TabId' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, Button) == 0x000008, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::Button' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, LocalTab) == 0x000010, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::LocalTab' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, LocalTabId) == 0x000018, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::LocalTabId' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000020, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_HandleTabButtonCreated, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'AthenaChallengesTab_C_HandleTabButtonCreated::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SetupViewedItemData
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengesTab_C_SetupViewedItemData final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_SetupViewedItemData) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SetupViewedItemData");
static_assert(sizeof(AthenaChallengesTab_C_SetupViewedItemData) == 0x000008, "Wrong size on AthenaChallengesTab_C_SetupViewedItemData");
static_assert(offsetof(AthenaChallengesTab_C_SetupViewedItemData, Item) == 0x000000, "Member 'AthenaChallengesTab_C_SetupViewedItemData::Item' has a wrong offset!");

}

