#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PartySuggestion

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_PartySuggestion.Athena_PartySuggestion_C
// 0x01B8 (0x03C0 - 0x0208)
class UAthena_PartySuggestion_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_PartyIconsDisplay_C*            Athena_PartyIconsDisplay;                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2isLFG;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Master;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_LFG_PartyFillType;                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_PartyName;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Status;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PartyFocused;                                      // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsActive;                                         // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurDisplayedPlayerName;                            // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurPartySize;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCurIsLFG;                                         // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_AnimOutro;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bPartySuggestionInQueue;                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSuggestionMouseDown;                             // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFortPartySuggestion                   NewPartyStruct;                                    // 0x02D0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortPartySuggestion                   CurPartyStruct;                                    // 0x0348(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_PartySuggestion(int32 EntryPoint);
	void ClobberSuggestion();
	void DismissSuggestion();
	void PlayIntro();
	void OnHovered();
	void OnUnhovered();
	void HidePartySuggestion();
	void PlayOutro();
	void PreConstruct(bool IsDesignTime);
	void InitNewPartySuggestion(const struct FFortPartySuggestion& NewPartySuggestion);
	void NewPartySuggestion(const struct FFortPartySuggestion& Party_Suggestion_Struct);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void UpdateDisplay();
	void UpdatePartySuggestion(const struct FFortPartySuggestion& PartySuggestionStruct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_PartySuggestion_C">();
	}
	static class UAthena_PartySuggestion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_PartySuggestion_C>();
	}
};
static_assert(alignof(UAthena_PartySuggestion_C) == 0x000008, "Wrong alignment on UAthena_PartySuggestion_C");
static_assert(sizeof(UAthena_PartySuggestion_C) == 0x0003C0, "Wrong size on UAthena_PartySuggestion_C");
static_assert(offsetof(UAthena_PartySuggestion_C, UberGraphFrame) == 0x000208, "Member 'UAthena_PartySuggestion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Outro) == 0x000210, "Member 'UAthena_PartySuggestion_C::Outro' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Hovered) == 0x000218, "Member 'UAthena_PartySuggestion_C::Hovered' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Intro) == 0x000220, "Member 'UAthena_PartySuggestion_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Athena_PartyIconsDisplay) == 0x000228, "Member 'UAthena_PartySuggestion_C::Athena_PartyIconsDisplay' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Border_0) == 0x000230, "Member 'UAthena_PartySuggestion_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CommonTextBlock_0) == 0x000238, "Member 'UAthena_PartySuggestion_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CommonTextBlock_1) == 0x000240, "Member 'UAthena_PartySuggestion_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CommonTextBlock_2isLFG) == 0x000248, "Member 'UAthena_PartySuggestion_C::CommonTextBlock_2isLFG' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Image_0) == 0x000250, "Member 'UAthena_PartySuggestion_C::Image_0' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, O_Master) == 0x000258, "Member 'UAthena_PartySuggestion_C::O_Master' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Switcher_LFG_PartyFillType) == 0x000260, "Member 'UAthena_PartySuggestion_C::Switcher_LFG_PartyFillType' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, T_PartyName) == 0x000268, "Member 'UAthena_PartySuggestion_C::T_PartyName' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Text_Status) == 0x000270, "Member 'UAthena_PartySuggestion_C::Text_Status' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, PartyFocused) == 0x000278, "Member 'UAthena_PartySuggestion_C::PartyFocused' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, bIsActive) == 0x000288, "Member 'UAthena_PartySuggestion_C::bIsActive' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CurDisplayedPlayerName) == 0x000290, "Member 'UAthena_PartySuggestion_C::CurDisplayedPlayerName' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CurPartySize) == 0x0002A8, "Member 'UAthena_PartySuggestion_C::CurPartySize' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, bCurIsLFG) == 0x0002AC, "Member 'UAthena_PartySuggestion_C::bCurIsLFG' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, Timer_AnimOutro) == 0x0002B0, "Member 'UAthena_PartySuggestion_C::Timer_AnimOutro' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, bPartySuggestionInQueue) == 0x0002B8, "Member 'UAthena_PartySuggestion_C::bPartySuggestionInQueue' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, OnSuggestionMouseDown) == 0x0002C0, "Member 'UAthena_PartySuggestion_C::OnSuggestionMouseDown' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, NewPartyStruct) == 0x0002D0, "Member 'UAthena_PartySuggestion_C::NewPartyStruct' has a wrong offset!");
static_assert(offsetof(UAthena_PartySuggestion_C, CurPartyStruct) == 0x000348, "Member 'UAthena_PartySuggestion_C::CurPartyStruct' has a wrong offset!");

}

