#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Fragment_Container

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "E_OutlanderFragmentTypes_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Fragment_Container.B_Fragment_Container_C.ExecuteUbergraph_B_Fragment_Container
// 0x0768 (0x0768 - 0x0000)
struct B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0020(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x0050(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00E8(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue12;          // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent1;   // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor1;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp1;             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex1;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0148(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn1;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn12;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutlander_IsOutlander;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0218(0x0008)(NoDestructor)
	E_OutlanderFragmentTypes                      Temp_byte_Variable;                                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0228(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess123;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutlander_IsOutlander1;                 // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x1];                                      // 0x0253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0254(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue12;               // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0268(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue123;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutlander_IsOutlander12;                // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface1_CastInput; // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue1;  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0334(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue1234;             // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1234;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue123;         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1234;        // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue1; // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerPawn*>                CallFunc_AuthorityGetFortPossessedPlayerPawns_ReturnValue; // 0x0380(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0398(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x03B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x03F4(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0410(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0428(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0440(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult1;   // 0x04C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult12;  // 0x0550(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable12;               // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x05DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x05E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameModeDeployableBase*            K2Node_DynamicCast_AsFort_Game_Mode_Deployable_Base; // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12345;                  // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameModeOutpost*                   K2Node_DynamicCast_AsFort_Game_Mode_Outpost;       // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess123456;                 // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue12345;       // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693[0x5];                                      // 0x0693(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue1;               // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable12;                     // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller1;      // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1234567;                // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimSequence*                          K2Node_CustomEvent_AnimToPlay;                     // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x06D8(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item1;                          // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue1;   // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0700(0x0018)()
	bool                                          K2Node_SwitchEnum123_CmpSuccess;                   // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue12; // 0x071C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0724(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue12;                 // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x3];                                      // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue12;        // 0x073C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue12; // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue123; // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container) == 0x000008, "Wrong alignment on B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container");
static_assert(sizeof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container) == 0x000768, "Wrong size on B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, EntryPoint) == 0x000000, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAuthority_ReturnValue1) == 0x000018, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000019, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_Damage) == 0x00001C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_DamageTags) == 0x000020, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_Momentum) == 0x000040, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_HitInfo) == 0x000050, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_InstigatedBy) == 0x0000D8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_DamageCauser) == 0x0000E0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_EffectContext) == 0x0000E8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_bool_Has_Been_Initd_Variable) == 0x000100, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_InteractingPawn) == 0x000108, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Add_IntInt_ReturnValue) == 0x000110, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000118, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_SwitchEnum_CmpSuccess) == 0x000121, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsDedicatedServer_ReturnValue12) == 0x000122, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsDedicatedServer_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OverlappedComponent1) == 0x000128, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OverlappedComponent1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherActor1) == 0x000130, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherActor1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherComp1) == 0x000138, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherComp1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherBodyIndex1) == 0x000140, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherBodyIndex1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_bFromSweep) == 0x000144, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_SweepResult) == 0x000148, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001D0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherActor) == 0x0001D8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherComp) == 0x0001E0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001E8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_AsFort_Player_Pawn1) == 0x0001F0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_AsFort_Player_Pawn1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_bSuccess1) == 0x0001F8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_AsFort_Player_Pawn12) == 0x000200, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_AsFort_Player_Pawn12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_bSuccess12) == 0x000208, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_Event_DeltaSeconds) == 0x00020C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsOutlander_IsOutlander) == 0x000210, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsOutlander_IsOutlander' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_bool_IsClosed_Variable) == 0x000211, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsValid_ReturnValue) == 0x000212, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000213, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_int_Array_Index_Variable) == 0x000214, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_SetTimer_ReturnValue) == 0x000218, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_byte_Variable) == 0x000220, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_bool_IsClosed_Variable1) == 0x000221, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000228, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Array_Get_Item) == 0x000238, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_AsFort_Pawn) == 0x000248, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_bSuccess123) == 0x000250, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_bSuccess123' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Less_IntInt_ReturnValue) == 0x000251, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsOutlander_IsOutlander1) == 0x000252, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsOutlander_IsOutlander1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_MakeVector_ReturnValue) == 0x000254, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAuthority_ReturnValue12) == 0x000260, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAuthority_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000268, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAuthority_ReturnValue123) == 0x0002F0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAuthority_ReturnValue123' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x0002F8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000308, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BooleanAND_ReturnValue) == 0x000309, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsOutlander_IsOutlander12) == 0x00030A, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsOutlander_IsOutlander12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface1_CastInput) == 0x000310, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface1_CastInput' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAllMatchingGameplayTags_ReturnValue1) == 0x000320, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAllMatchingGameplayTags_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000328, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BooleanAND_ReturnValue1) == 0x000330, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000334, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_HasAuthority_ReturnValue1234) == 0x00033C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_HasAuthority_ReturnValue1234' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_GetController_ReturnValue) == 0x000340, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000348, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_DynamicCast_bSuccess1234) == 0x000350, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_DynamicCast_bSuccess1234' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000354, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_bool_True_if_break_was_hit_Variable) == 0x000358, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Not_PreBool_ReturnValue) == 0x000359, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_int_Loop_Counter_Variable1) == 0x00035C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BooleanAND_ReturnValue12) == 0x000360, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BooleanAND_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Add_IntInt_ReturnValue1) == 0x000364, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsDedicatedServer_ReturnValue123) == 0x000368, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsDedicatedServer_ReturnValue123' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_RandomFloat_ReturnValue) == 0x00036C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000370, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000371, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, Temp_bool_Has_Been_Initd_Variable1) == 0x000372, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsDedicatedServer_ReturnValue1234) == 0x000373, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsDedicatedServer_ReturnValue1234' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, K2Node_SwitchEnum1_CmpSuccess) == 0x000374, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue1) == 0x000378, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_AuthorityGetFortPossessedPlayerPawns_ReturnValue) == 0x000380, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_AuthorityGetFortPossessedPlayerPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Array_Length_ReturnValue1) == 0x000390, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Less_IntInt_ReturnValue1) == 0x000394, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000398, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_IsValid_ReturnValue1) == 0x0003A4, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003A8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0003B4, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003C0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0003D0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003D8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0003E8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_VSize_ReturnValue) == 0x0003F0, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_MakeRotFromX_ReturnValue) == 0x0003F4, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000400, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BreakRotator_Roll) == 0x000404, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BreakRotator_Pitch) == 0x000408, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_BreakRotator_Yaw) == 0x00040C, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_MakeRotator_ReturnValue) == 0x000410, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000420, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_RLerp_ReturnValue) == 0x000428, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x000438, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000440, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_SetRelativeLocation_SweepHitResult1) == 0x0004C8, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_SetRelativeLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container, CallFunc_K2_SetRelativeLocation_SweepHitResult12) == 0x000550, "Member 'B_Fragment_Container_C_ExecuteUbergraph_B_Fragment_Container::CallFunc_K2_SetRelativeLocation_SweepHitResult12' has a wrong offset!");
