#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups.B_Pickups_C.ExecuteUbergraph_B_Pickups
// 0x03F0 (0x03F0 - 0x0000)
struct B_Pickups_C_ExecuteUbergraph_B_Pickups final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortIngredientItemDefinition*          K2Node_DynamicCast_AsFort_Ingredient_Item_Definition; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue1;                  // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable12;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable123;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x00AC(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable12;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickupBackpack*                    K2Node_DynamicCast_AsFort_Pickup_Backpack;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess123;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable123;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0200(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0218(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0224(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0234(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     Temp_object_Variable1234;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item1;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386[0x2];                                      // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable12345;                         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue12;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_393[0x5];                                      // 0x0393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable123456;                        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select1_Default;                            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item12;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue12;             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1234;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select12_Default;                           // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select123_Default;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x000008, "Wrong alignment on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(sizeof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x0003F0, "Wrong size on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, EntryPoint) == 0x000000, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_bool_Variable) == 0x000004, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_bool_Variable1) == 0x000005, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Array_Index_Variable) == 0x000008, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Ingredient_Item_Definition) == 0x000010, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Ingredient_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x000020, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_PickupTarget) == 0x000030, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_LastIndex_ReturnValue) == 0x000038, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsLocallyControlled_ReturnValue) == 0x00003C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetController_ReturnValue) == 0x000040, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000050, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess12) == 0x000058, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable) == 0x000068, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable) == 0x000070, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable1) == 0x000078, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue) == 0x00007C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_SwitchEnum_CmpSuccess) == 0x00007D, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue1) == 0x00007E, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000090, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable12) == 0x000098, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable123) == 0x00009C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable123' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_byte_Variable) == 0x0000A0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select_Default) == 0x0000A4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SelectRotator_ReturnValue) == 0x0000AC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable1) == 0x0000C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000150, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetOwner_ReturnValue) == 0x0001D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable12) == 0x0001E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Pickup_Backpack) == 0x0001E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Pickup_Backpack' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess123) == 0x0001F0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess123' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable123) == 0x0001F8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable123' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000200, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x00020C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_Origin) == 0x000218, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_BoxExtent) == 0x000224, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_SphereRadius) == 0x000230, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000234, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumMaterials_ReturnValue) == 0x000240, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_VectorVector_ReturnValue) == 0x000244, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000250, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue1) == 0x0002D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable) == 0x0002DC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0002E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable1234) == 0x000368, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable1234' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item) == 0x000370, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item1) == 0x000378, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Length_ReturnValue) == 0x000380, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue12) == 0x000384, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Less_IntInt_ReturnValue) == 0x000385, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable12345) == 0x000388, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable12345' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetSubGame_ReturnValue12) == 0x000390, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetSubGame_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_SwitchEnum1_CmpSuccess) == 0x000391, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000392, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_object_Variable123456) == 0x000398, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_object_Variable123456' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select1_Default) == 0x0003A0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable1) == 0x0003AC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0003B0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item12) == 0x0003B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue12) == 0x0003C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0003C4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue1) == 0x0003C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsMobilePlatform_ReturnValue) == 0x0003CC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetGameState_ReturnValue) == 0x0003D0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0003D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess1234) == 0x0003E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess1234' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select12_Default) == 0x0003E4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select12_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select123_Default) == 0x0003E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select123_Default' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Pickups_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Pickups_C_ReceiveTick");
static_assert(sizeof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong size on B_Pickups_C_ReceiveTick");
static_assert(offsetof(B_Pickups_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Pickups_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.OnAboutToEnterBackpack
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_C_OnAboutToEnterBackpack final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong alignment on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(sizeof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong size on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(offsetof(B_Pickups_C_OnAboutToEnterBackpack, PickupTarget) == 0x000000, "Member 'B_Pickups_C_OnAboutToEnterBackpack::PickupTarget' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct B_Pickups_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable1;                             // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue1;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Pickups_C_UserConstructionScript");
static_assert(sizeof(B_Pickups_C_UserConstructionScript) == 0x0000B0, "Wrong size on B_Pickups_C_UserConstructionScript");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable1) == 0x000030, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue1) == 0x000068, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000070, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x00007C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x000088, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00008C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x00008D, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000090, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_bool_Variable) == 0x000094, "Member 'B_Pickups_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, K2Node_Select_Default) == 0x000098, "Member 'B_Pickups_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A1, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SetRarityColor
// 0x00F0 (0x00F0 - 0x0000)
struct B_Pickups_C_SetRarityColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable123;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1234;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12345;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable123456;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1234567;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12345678;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable123456789;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x002C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item1;                          // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0070(0x0080)()
};
static_assert(alignof(B_Pickups_C_SetRarityColor) == 0x000008, "Wrong alignment on B_Pickups_C_SetRarityColor");
static_assert(sizeof(B_Pickups_C_SetRarityColor) == 0x0000F0, "Wrong size on B_Pickups_C_SetRarityColor");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_Pickups_C_SetRarityColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_byte_Variable) == 0x000001, "Member 'B_Pickups_C_SetRarityColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable) == 0x000004, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable1) == 0x000008, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable12) == 0x00000C, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable12' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable123) == 0x000010, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable123' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable1234) == 0x000014, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable1234' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable12345) == 0x000018, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable12345' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable123456) == 0x00001C, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable123456' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable1234567) == 0x000020, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable1234567' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable12345678) == 0x000024, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable12345678' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable123456789) == 0x000028, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable123456789' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_Array_Get_Item) == 0x00002C, "Member 'B_Pickups_C_SetRarityColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000040, "Member 'B_Pickups_C_SetRarityColor::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_Array_Get_Item1) == 0x000048, "Member 'B_Pickups_C_SetRarityColor::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_GetRarity_ReturnValue) == 0x000058, "Member 'B_Pickups_C_SetRarityColor::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000059, "Member 'B_Pickups_C_SetRarityColor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_SelectColor_ReturnValue) == 0x00005C, "Member 'B_Pickups_C_SetRarityColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, K2Node_Select_Default) == 0x00006C, "Member 'B_Pickups_C_SetRarityColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_BPGetRarityData_ReturnValue) == 0x000070, "Member 'B_Pickups_C_SetRarityColor::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SpawnPickedUpTrailPS
// 0x0028 (0x0028 - 0x0000)
struct B_Pickups_C_SpawnPickedUpTrailPS final
{
public:
	class UParticleSystemComponent*               TrailPS;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item1;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_SpawnPickedUpTrailPS) == 0x000008, "Wrong alignment on B_Pickups_C_SpawnPickedUpTrailPS");
static_assert(sizeof(B_Pickups_C_SpawnPickedUpTrailPS) == 0x000028, "Wrong size on B_Pickups_C_SpawnPickedUpTrailPS");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, TrailPS) == 0x000000, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::TrailPS' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item) == 0x000008, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item1) == 0x00000C, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000010, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SetHologramPickedUpParams
// 0x0080 (0x0080 - 0x0000)
struct B_Pickups_C_SetHologramPickedUpParams final
{
public:
	bool                                          Tier_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item12;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item123;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue1;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue1;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue12;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue123;      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_SetHologramPickedUpParams) == 0x000008, "Wrong alignment on B_Pickups_C_SetHologramPickedUpParams");
static_assert(sizeof(B_Pickups_C_SetHologramPickedUpParams) == 0x000080, "Wrong size on B_Pickups_C_SetHologramPickedUpParams");
static_assert(offsetof(B_Pickups_C_SetHologramPickedUpParams, Tier_0) == 0x000000, "Member 'B_Pickups_C_SetHologramPickedUpParams::Tier_0' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetHologramPickedUpParams, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_Pickups_C_SetHologramPickedUpParams::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetHologramPickedUpParams, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_Pickups_C_SetHologramPickedUpParams::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
