#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pickups.B_Pickups_C
// 0x0228 (0x0590 - 0x0368)
class AB_Pickups_C final : public AFortPickupEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UPointLightComponent*                   Light;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Background;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pivot_Offset;                                      // 0x0390(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_Bias;                                     // 0x039C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   Static_Mesh_Pickup;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Pickup;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkeletalMesh;                                    // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_a_Backpack;                                     // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    SkeletalOrStaticMeshAssetPrimitive;                // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentElementIndex;                               // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MIDArray;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             CurrentMaterial;                                   // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             CurrentParentMaterial;                             // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          MaterialParentIsValid;                             // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BackpackParticleSystem;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Accumulation;                                 // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_After_Being_picked_up;                       // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tossed;                                            // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Activate_Rarity_Particle_Systems;                  // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       Mesh_MIDs;                                         // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FLinearColor                           Rarity_Color;                                      // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rarity_Level;                                      // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               PickedUp_MID;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sweep_Brightness;                                  // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 Sweep_Speed;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Component_Radius__Scaled_;                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Component_Radius_Multiplier;                       // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sparkle_Spawn_Rate__Ground_;                       // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                   Outline_Rarity_Colors;                             // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Component_Radius;                                  // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Delay_Before_Glow;                       // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_In_Time;                            // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Hold_Time;                               // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_Out_Time;                           // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Sweep_Speed;                             // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBluglo;                                          // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BlugloParticleSystem;                              // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Picked_Up_Trail_PS;                                // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sparkle_Spawn_Rate__Picked_Up_;                    // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 Lifetime__Picked_Up_;                              // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsLootGiftForOthers;                               // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   PickupForceFeedback;                               // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Violentium_Idle_FX;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Violentium;                                     // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 MIDsNeedingRelease;                                // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             MaterialToRestoreAfterRelease;                     // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         Names_of_Materials_Exempt_from_Repartening;        // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         Names_of_Parent_Materials_Exempt_from_Repartening; // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<bool>                                  Array_Check;                                       // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               NewVar_1;                                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Max_Draw_Distance_StW;                             // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Draw_Distance_Athena;                          // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Draw_Distance_Bacchus;                         // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasUniqueMaterialIds;                              // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Sweep_Brightness_Test;                             // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             Materials_to_Restore_After_Release;                // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Pickups(int32 EntryPoint);
	void ReceiveDestroyed();
	void OnTossed();
	void ReceiveTick(float DeltaSeconds);
	void OnAboutToEnterBackpack(class AFortPawn* PickupTarget);
	void OnPickedUp();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetRarityColor();
	void SpawnPickedUpTrailPS();
	void SetHologramPickedUpParams(bool Tier_0);
	void ScaleHologramTimingsForPvP();
	void ReleaseStretchMIDs();
	void DestroyBackgroundVisualComponents();
	void SetupLight();
	void SetHiddenBackgroundVisualComponents(bool Hidden);
	void SetupBaseMIDs();
	void SetupStretchMIDs();
	void Unique_Material_MIDs(bool* Has_Unique_MIDs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_C">();
	}
	static class AB_Pickups_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_C>();
	}
};
static_assert(alignof(AB_Pickups_C) == 0x000008, "Wrong alignment on AB_Pickups_C");
static_assert(sizeof(AB_Pickups_C) == 0x000590, "Wrong size on AB_Pickups_C");
static_assert(offsetof(AB_Pickups_C, UberGraphFrame) == 0x000368, "Member 'AB_Pickups_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Light) == 0x000370, "Member 'AB_Pickups_C::Light' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Background) == 0x000378, "Member 'AB_Pickups_C::Background' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ParticleSystem) == 0x000380, "Member 'AB_Pickups_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Root) == 0x000388, "Member 'AB_Pickups_C::Root' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Pivot_Offset) == 0x000390, "Member 'AB_Pickups_C::Pivot_Offset' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rotation_Bias) == 0x00039C, "Member 'AB_Pickups_C::Rotation_Bias' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Static_Mesh_Pickup) == 0x0003A8, "Member 'AB_Pickups_C::Static_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Skeletal_Mesh_Pickup) == 0x0003B0, "Member 'AB_Pickups_C::Skeletal_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsSkeletalMesh) == 0x0003B8, "Member 'AB_Pickups_C::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Is_a_Backpack) == 0x0003B9, "Member 'AB_Pickups_C::Is_a_Backpack' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, SkeletalOrStaticMeshAssetPrimitive) == 0x0003C0, "Member 'AB_Pickups_C::SkeletalOrStaticMeshAssetPrimitive' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentElementIndex) == 0x0003C8, "Member 'AB_Pickups_C::CurrentElementIndex' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MIDArray) == 0x0003D0, "Member 'AB_Pickups_C::MIDArray' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentMaterial) == 0x0003E0, "Member 'AB_Pickups_C::CurrentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentParentMaterial) == 0x0003F0, "Member 'AB_Pickups_C::CurrentParentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MaterialParentIsValid) == 0x000400, "Member 'AB_Pickups_C::MaterialParentIsValid' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, BackpackParticleSystem) == 0x000408, "Member 'AB_Pickups_C::BackpackParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Tick_Accumulation) == 0x000410, "Member 'AB_Pickups_C::Tick_Accumulation' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Speed_After_Being_picked_up) == 0x000414, "Member 'AB_Pickups_C::Speed_After_Being_picked_up' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Tossed) == 0x000418, "Member 'AB_Pickups_C::Tossed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Activate_Rarity_Particle_Systems) == 0x000419, "Member 'AB_Pickups_C::Activate_Rarity_Particle_Systems' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Mesh_MIDs) == 0x000420, "Member 'AB_Pickups_C::Mesh_MIDs' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rarity_Color) == 0x000430, "Member 'AB_Pickups_C::Rarity_Color' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rarity_Level) == 0x000440, "Member 'AB_Pickups_C::Rarity_Level' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, PickedUp_MID) == 0x000448, "Member 'AB_Pickups_C::PickedUp_MID' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sweep_Brightness) == 0x000450, "Member 'AB_Pickups_C::Sweep_Brightness' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sweep_Speed) == 0x000460, "Member 'AB_Pickups_C::Sweep_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Component_Radius__Scaled_) == 0x000470, "Member 'AB_Pickups_C::Component_Radius__Scaled_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Component_Radius_Multiplier) == 0x000474, "Member 'AB_Pickups_C::Component_Radius_Multiplier' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sparkle_Spawn_Rate__Ground_) == 0x000478, "Member 'AB_Pickups_C::Sparkle_Spawn_Rate__Ground_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Outline_Rarity_Colors) == 0x000488, "Member 'AB_Pickups_C::Outline_Rarity_Colors' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Component_Radius) == 0x000498, "Member 'AB_Pickups_C::Component_Radius' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Delay_Before_Glow) == 0x00049C, "Member 'AB_Pickups_C::Picked_Up_Delay_Before_Glow' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Fade_In_Time) == 0x0004A0, "Member 'AB_Pickups_C::Picked_Up_Fade_In_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Hold_Time) == 0x0004A4, "Member 'AB_Pickups_C::Picked_Up_Hold_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Fade_Out_Time) == 0x0004A8, "Member 'AB_Pickups_C::Picked_Up_Fade_Out_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Sweep_Speed) == 0x0004AC, "Member 'AB_Pickups_C::Picked_Up_Sweep_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsBluglo) == 0x0004B0, "Member 'AB_Pickups_C::IsBluglo' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, BlugloParticleSystem) == 0x0004B8, "Member 'AB_Pickups_C::BlugloParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Trail_PS) == 0x0004C0, "Member 'AB_Pickups_C::Picked_Up_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sparkle_Spawn_Rate__Picked_Up_) == 0x0004C8, "Member 'AB_Pickups_C::Sparkle_Spawn_Rate__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Lifetime__Picked_Up_) == 0x0004D8, "Member 'AB_Pickups_C::Lifetime__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsLootGiftForOthers) == 0x0004E8, "Member 'AB_Pickups_C::IsLootGiftForOthers' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, PickupForceFeedback) == 0x0004F0, "Member 'AB_Pickups_C::PickupForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Violentium_Idle_FX) == 0x0004F8, "Member 'AB_Pickups_C::Violentium_Idle_FX' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Is_Violentium) == 0x000500, "Member 'AB_Pickups_C::Is_Violentium' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MIDsNeedingRelease) == 0x000508, "Member 'AB_Pickups_C::MIDsNeedingRelease' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MaterialToRestoreAfterRelease) == 0x000518, "Member 'AB_Pickups_C::MaterialToRestoreAfterRelease' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Names_of_Materials_Exempt_from_Repartening) == 0x000528, "Member 'AB_Pickups_C::Names_of_Materials_Exempt_from_Repartening' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Names_of_Parent_Materials_Exempt_from_Repartening) == 0x000538, "Member 'AB_Pickups_C::Names_of_Parent_Materials_Exempt_from_Repartening' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Array_Check) == 0x000548, "Member 'AB_Pickups_C::Array_Check' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, NewVar_1) == 0x000558, "Member 'AB_Pickups_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Max_Draw_Distance_StW) == 0x000560, "Member 'AB_Pickups_C::Max_Draw_Distance_StW' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Max_Draw_Distance_Athena) == 0x000564, "Member 'AB_Pickups_C::Max_Draw_Distance_Athena' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Max_Draw_Distance_Bacchus) == 0x000568, "Member 'AB_Pickups_C::Max_Draw_Distance_Bacchus' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, HasUniqueMaterialIds) == 0x00056C, "Member 'AB_Pickups_C::HasUniqueMaterialIds' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sweep_Brightness_Test) == 0x000570, "Member 'AB_Pickups_C::Sweep_Brightness_Test' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Materials_to_Restore_After_Release) == 0x000580, "Member 'AB_Pickups_C::Materials_to_Restore_After_Release' has a wrong offset!");

}

