#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_Explosion_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Post_Explosion_Generic.B_Post_Explosion_Generic_C
// 0x0578 (0x0890 - 0x0318)
class AB_Post_Explosion_Generic_C : public AActor
{
public:
	class UPostProcessComponent*                  PostFX;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PostFX_SphereComponent;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PostFX_PreviewScale;                               // 0x0328(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PostFX_BlendRadius;                                // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PostFX_ShakeEpicenter;                             // 0x0338(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostFX_ShakeOuterradius;                           // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostFX_ShakeInnerRadius;                           // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCameraShake;                                    // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CameraShakeClass;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseForceFeedback;                                  // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeactivateDelay;                                   // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PostFX_Settings;                                   // 0x0360(0x0520)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UForceFeedbackEffect*                   ForceFeedbackNear;                                 // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedbackFar;                                  // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_Explosion_Generic_C">();
	}
	static class AB_Post_Explosion_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_Explosion_Generic_C>();
	}
};
static_assert(alignof(AB_Post_Explosion_Generic_C) == 0x000010, "Wrong alignment on AB_Post_Explosion_Generic_C");
static_assert(sizeof(AB_Post_Explosion_Generic_C) == 0x000890, "Wrong size on AB_Post_Explosion_Generic_C");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX) == 0x000318, "Member 'AB_Post_Explosion_Generic_C::PostFX' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_SphereComponent) == 0x000320, "Member 'AB_Post_Explosion_Generic_C::PostFX_SphereComponent' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_PreviewScale) == 0x000328, "Member 'AB_Post_Explosion_Generic_C::PostFX_PreviewScale' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_BlendRadius) == 0x000334, "Member 'AB_Post_Explosion_Generic_C::PostFX_BlendRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeEpicenter) == 0x000338, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeEpicenter' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeOuterradius) == 0x000344, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeOuterradius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeInnerRadius) == 0x000348, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeInnerRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, UseCameraShake) == 0x00034C, "Member 'AB_Post_Explosion_Generic_C::UseCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, CameraShakeClass) == 0x000350, "Member 'AB_Post_Explosion_Generic_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, UseForceFeedback) == 0x000358, "Member 'AB_Post_Explosion_Generic_C::UseForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, DeactivateDelay) == 0x00035C, "Member 'AB_Post_Explosion_Generic_C::DeactivateDelay' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_Settings) == 0x000360, "Member 'AB_Post_Explosion_Generic_C::PostFX_Settings' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, ForceFeedbackNear) == 0x000880, "Member 'AB_Post_Explosion_Generic_C::ForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, ForceFeedbackFar) == 0x000888, "Member 'AB_Post_Explosion_Generic_C::ForceFeedbackFar' has a wrong offset!");

}

