#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_SmokeGrenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.ExecuteUbergraph_B_Prj_Athena_SmokeGrenade
// 0x0480 (0x0480 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x0008(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x00A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00D8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0184(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0xD];                                      // 0x01F3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Athena_SmokeGrenade_FXVolume_C*  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0268(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x02FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0308(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x0314(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x0320(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x0358(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x0364(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn1;                        // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0388(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue1;               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x03C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x03E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade) == 0x000010, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade) == 0x000480, "Wrong size on B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_Hit1) == 0x000008, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_HitActors) == 0x000090, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_HitResults) == 0x0000A0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_Damage) == 0x0000B0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_DamageType) == 0x0000B8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_InstigatedBy) == 0x0000C0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_DamageCauser) == 0x0000C8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_Event_Hit) == 0x0000D8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_bBlockingHit) == 0x000160, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_bInitialOverlap) == 0x000161, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Location) == 0x00016C, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Normal) == 0x000184, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_FaceIndex) == 0x0001C4, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_TraceStart) == 0x0001C8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_TraceEnd) == 0x0001D4, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_DynamicCast_AsPawn) == 0x0001E0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_Add_IntInt_ReturnValue) == 0x0001EC, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001F0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, Temp_bool_Has_Been_Initd_Variable) == 0x0001F1, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, Temp_bool_Has_Been_Initd_Variable1) == 0x0001F2, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_MakeTransform_ReturnValue) == 0x000200, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000230, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_FinishSpawningActor_ReturnValue) == 0x000238, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000240, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, Temp_bool_IsClosed_Variable) == 0x000241, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000248, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_OtherActor) == 0x000250, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_OtherComp) == 0x000258, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000260, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_bFromSweep) == 0x000264, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_ComponentBoundEvent_SweepResult) == 0x000268, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_bBlockingHit1) == 0x0002F0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_bInitialOverlap1) == 0x0002F1, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Time1) == 0x0002F4, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Distance1) == 0x0002F8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Location1) == 0x0002FC, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_ImpactPoint1) == 0x000308, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_Normal1) == 0x000314, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_ImpactNormal1) == 0x000320, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_PhysMat1) == 0x000330, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitActor1) == 0x000338, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitComponent1) == 0x000340, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitBoneName1) == 0x000348, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_HitItem1) == 0x000350, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_FaceIndex1) == 0x000354, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_TraceStart1) == 0x000358, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakHitResult_TraceEnd1) == 0x000364, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_DynamicCast_AsPawn1) == 0x000370, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_DynamicCast_AsPawn1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_DynamicCast_bSuccess1) == 0x000378, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, Temp_bool_IsClosed_Variable1) == 0x000379, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_Add_IntInt_ReturnValue1) == 0x00037C, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_GetInstigator_ReturnValue) == 0x000380, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000388, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000394, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakVector_X) == 0x000398, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakVector_Y) == 0x00039C, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_BreakVector_Z) == 0x0003A0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_Abs_ReturnValue) == 0x0003A4, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_GetInstigator_ReturnValue1) == 0x0003A8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_GetInstigator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_MakeVector_ReturnValue) == 0x0003B0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_NotEqual_ObjectObject_ReturnValue1) == 0x0003BC, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_NotEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0003C0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003CC, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_GetParentActor_ReturnValue) == 0x0003D8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0003E0, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0003E4, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, CallFunc_MakeHitResult_ReturnValue) == 0x0003E8, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade, K2Node_SwitchEnum_CmpSuccess) == 0x000470, "Member 'B_Prj_Athena_SmokeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SmokeGrenade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_Prj_Athena_SmokeGrenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.OnBounce
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_OnBounce) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_OnBounce");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_OnBounce) == 0x000088, "Wrong size on B_Prj_Athena_SmokeGrenade_C_OnBounce");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage) == 0x000020, "Wrong size on B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'B_Prj_Athena_SmokeGrenade_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_OnExploded) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_OnExploded");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_OnExploded) == 0x000020, "Wrong size on B_Prj_Athena_SmokeGrenade_C_OnExploded");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnExploded, HitResults) == 0x000010, "Member 'B_Prj_Athena_SmokeGrenade_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_OnStop) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_OnStop");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_OnStop) == 0x000088, "Wrong size on B_Prj_Athena_SmokeGrenade_C_OnStop");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_UserConstructionScript) == 0x000001, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_UserConstructionScript) == 0x000001, "Wrong size on B_Prj_Athena_SmokeGrenade_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_SmokeGrenade.B_Prj_Athena_SmokeGrenade_C.OnRep_StoredHit
// 0x0080 (0x0080 - 0x0000)
struct B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit final
{
public:
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit) == 0x000008, "Wrong alignment on B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit");
static_assert(sizeof(B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit) == 0x000080, "Wrong size on B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit, CallFunc_BreakHitResult_bBlockingHit) == 0x000000, "Member 'B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit, CallFunc_BreakHitResult_bInitialOverlap) == 0x000001, "Member 'B_Prj_Athena_SmokeGrenade_C_OnRep_StoredHit::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
