#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_DanceGrenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_DanceGrenade.B_Prj_Athena_DanceGrenade_C
// 0x0140 (0x08C8 - 0x0788)
class AB_Prj_Athena_DanceGrenade_C final : public AFortProjectileBase
{
public:
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UCapsuleComponent*                      OverlapCapsule;                                    // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fuse_Particle;                                     // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SmokeGrenadeFuse_AudioComponent;                   // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Explosion;                                       // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x07C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Cue_DistantSound;                                  // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplosionRadius;                                   // 0x07E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfBouncesTillCook;                           // 0x07EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentNumberOfBounces;                            // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Cue_GrenadeFuseSound;                              // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BouncePawnAgainstPawnGravityScale;                 // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             StoredHit;                                         // 0x0808(0x0088)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, ContainsInstancedReference)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_Bounce;                                        // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  StunAbility;                                       // 0x08A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Prj_Athena_DanceGrenade(int32 EntryPoint);
	void Cook();
	void BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnBounce(const struct FHitResult& Hit);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void Stop_Rotation();
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void OnRep_StoredHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_DanceGrenade_C">();
	}
	static class AB_Prj_Athena_DanceGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_DanceGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_DanceGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_DanceGrenade_C");
static_assert(sizeof(AB_Prj_Athena_DanceGrenade_C) == 0x0008C8, "Wrong size on AB_Prj_Athena_DanceGrenade_C");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, UberGraphFrame) == 0x000790, "Member 'AB_Prj_Athena_DanceGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, OverlapCapsule) == 0x000798, "Member 'AB_Prj_Athena_DanceGrenade_C::OverlapCapsule' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, RotatingMovement) == 0x0007A0, "Member 'AB_Prj_Athena_DanceGrenade_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Fuse_Particle) == 0x0007A8, "Member 'AB_Prj_Athena_DanceGrenade_C::Fuse_Particle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Mesh) == 0x0007B0, "Member 'AB_Prj_Athena_DanceGrenade_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, SmokeGrenadeFuse_AudioComponent) == 0x0007B8, "Member 'AB_Prj_Athena_DanceGrenade_C::SmokeGrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, P_Explosion) == 0x0007C0, "Member 'AB_Prj_Athena_DanceGrenade_C::P_Explosion' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, HitLocation) == 0x0007C8, "Member 'AB_Prj_Athena_DanceGrenade_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Cue_DistantSound) == 0x0007D8, "Member 'AB_Prj_Athena_DanceGrenade_C::Cue_DistantSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Cue_CloseSound) == 0x0007E0, "Member 'AB_Prj_Athena_DanceGrenade_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ExplosionRadius) == 0x0007E8, "Member 'AB_Prj_Athena_DanceGrenade_C::ExplosionRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, NumberOfBouncesTillCook) == 0x0007EC, "Member 'AB_Prj_Athena_DanceGrenade_C::NumberOfBouncesTillCook' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, CurrentNumberOfBounces) == 0x0007F0, "Member 'AB_Prj_Athena_DanceGrenade_C::CurrentNumberOfBounces' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Cue_GrenadeFuseSound) == 0x0007F8, "Member 'AB_Prj_Athena_DanceGrenade_C::Cue_GrenadeFuseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, BouncePawnAgainstPawnGravityScale) == 0x000800, "Member 'AB_Prj_Athena_DanceGrenade_C::BouncePawnAgainstPawnGravityScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, StoredHit) == 0x000808, "Member 'AB_Prj_Athena_DanceGrenade_C::StoredHit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ExplosionForceFeedbackNear) == 0x000890, "Member 'AB_Prj_Athena_DanceGrenade_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ExplosionForceFeedbackFar) == 0x000898, "Member 'AB_Prj_Athena_DanceGrenade_C::ExplosionForceFeedbackFar' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Cue_Bounce) == 0x0008A0, "Member 'AB_Prj_Athena_DanceGrenade_C::Cue_Bounce' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, StunAbility) == 0x0008A8, "Member 'AB_Prj_Athena_DanceGrenade_C::StunAbility' has a wrong offset!");

}

