#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_Grenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.ExecuteUbergraph_B_Prj_Athena_Grenade
// 0x0498 (0x0498 - 0x0000)
struct B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_HitActors;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     K2Node_Event_HitResults;                           // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0078(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0168(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0174(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x0238(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x02E8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x037C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0388(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x0394(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x03A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x03D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x03E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn1;                        // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0400(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue1;               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x042C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue12;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0440(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0450(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x045C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue12;        // 0x0470(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue123;       // 0x047C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1234;      // 0x0488(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade");
static_assert(sizeof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade) == 0x000498, "Wrong size on B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_HitActors) == 0x000008, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_HitResults) == 0x000018, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_HitResults' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_Damage) == 0x000028, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_DamageType) == 0x000030, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_InstigatedBy) == 0x000038, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_DamageCauser) == 0x000040, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_GetInstigator_ReturnValue) == 0x000058, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_IsLocallyControlled_ReturnValue) == 0x000060, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000064, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_IsDedicatedServer_ReturnValue) == 0x000070, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_Hit) == 0x000078, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_bBlockingHit) == 0x000100, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_bInitialOverlap) == 0x000101, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Time) == 0x000104, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Distance) == 0x000108, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Location) == 0x00010C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_ImpactPoint) == 0x000118, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Normal) == 0x000124, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_ImpactNormal) == 0x000130, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_PhysMat) == 0x000140, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitActor) == 0x000148, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitComponent) == 0x000150, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_FaceIndex) == 0x000164, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_TraceStart) == 0x000168, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_TraceEnd) == 0x000174, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_DynamicCast_AsPawn) == 0x000180, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Add_IntInt_ReturnValue) == 0x00018C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, Temp_bool_Has_Been_Initd_Variable) == 0x000190, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_GetPlayerController_ReturnValue) == 0x000198, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_GetInstigatorController_ReturnValue) == 0x0001A0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_OnSameTeam_ReturnValue) == 0x0001A8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001B0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_Event_Hit1) == 0x000238, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002C0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002C8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_OtherActor) == 0x0002D0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_OtherComp) == 0x0002D8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002E0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002E4, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_ComponentBoundEvent_SweepResult) == 0x0002E8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_bBlockingHit1) == 0x000370, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_bInitialOverlap1) == 0x000371, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Time1) == 0x000374, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Distance1) == 0x000378, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Location1) == 0x00037C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_ImpactPoint1) == 0x000388, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_Normal1) == 0x000394, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_ImpactNormal1) == 0x0003A0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_PhysMat1) == 0x0003B0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitActor1) == 0x0003B8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitComponent1) == 0x0003C0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitBoneName1) == 0x0003C8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_HitItem1) == 0x0003D0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_FaceIndex1) == 0x0003D4, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_TraceStart1) == 0x0003D8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakHitResult_TraceEnd1) == 0x0003E4, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_DynamicCast_AsPawn1) == 0x0003F0, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_DynamicCast_AsPawn1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, K2Node_DynamicCast_bSuccess1) == 0x0003F8, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_IsDedicatedServer_ReturnValue1) == 0x0003F9, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Add_IntInt_ReturnValue1) == 0x0003FC, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000400, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_GetInstigator_ReturnValue1) == 0x000410, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_GetInstigator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakVector_X) == 0x000418, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakVector_Y) == 0x00041C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_BreakVector_Z) == 0x000420, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000424, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Abs_ReturnValue) == 0x000428, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_MakeVector_ReturnValue) == 0x00042C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_GetInstigator_ReturnValue12) == 0x000438, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_GetInstigator_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000440, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_NotEqual_ObjectObject_ReturnValue1) == 0x00044C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_NotEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000450, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00045C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000468, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_GetActorLocation_ReturnValue12) == 0x000470, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_GetActorLocation_ReturnValue12' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_GetActorLocation_ReturnValue123) == 0x00047C, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_GetActorLocation_ReturnValue123' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade, CallFunc_K2_GetActorLocation_ReturnValue1234) == 0x000488, "Member 'B_Prj_Athena_Grenade_C_ExecuteUbergraph_B_Prj_Athena_Grenade::CallFunc_K2_GetActorLocation_ReturnValue1234' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_Prj_Athena_Grenade_C_BndEvt__OverlapCapsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.OnBounce
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Athena_Grenade_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_OnBounce) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_OnBounce");
static_assert(sizeof(B_Prj_Athena_Grenade_C_OnBounce) == 0x000088, "Wrong size on B_Prj_Athena_Grenade_C_OnBounce");
static_assert(offsetof(B_Prj_Athena_Grenade_C_OnBounce, Hit) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_OnBounce::Hit' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Athena_Grenade_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_ReceiveAnyDamage");
static_assert(sizeof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage) == 0x000020, "Wrong size on B_Prj_Athena_Grenade_C_ReceiveAnyDamage");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'B_Prj_Athena_Grenade_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'B_Prj_Athena_Grenade_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'B_Prj_Athena_Grenade_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.OnExploded
// 0x0020 (0x0020 - 0x0000)
struct B_Prj_Athena_Grenade_C_OnExploded final
{
public:
	TArray<class AActor*>                         HitActors;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_OnExploded) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_OnExploded");
static_assert(sizeof(B_Prj_Athena_Grenade_C_OnExploded) == 0x000020, "Wrong size on B_Prj_Athena_Grenade_C_OnExploded");
static_assert(offsetof(B_Prj_Athena_Grenade_C_OnExploded, HitActors) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_OnExploded::HitActors' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_Grenade_C_OnExploded, HitResults) == 0x000010, "Member 'B_Prj_Athena_Grenade_C_OnExploded::HitResults' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Athena_Grenade_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_OnStop) == 0x000008, "Wrong alignment on B_Prj_Athena_Grenade_C_OnStop");
static_assert(sizeof(B_Prj_Athena_Grenade_C_OnStop) == 0x000088, "Wrong size on B_Prj_Athena_Grenade_C_OnStop");
static_assert(offsetof(B_Prj_Athena_Grenade_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Athena_Grenade.B_Prj_Athena_Grenade_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_Prj_Athena_Grenade_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_Grenade_C_UserConstructionScript) == 0x000001, "Wrong alignment on B_Prj_Athena_Grenade_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Athena_Grenade_C_UserConstructionScript) == 0x000001, "Wrong size on B_Prj_Athena_Grenade_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Athena_Grenade_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Prj_Athena_Grenade_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

