#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SupplyDropPlacement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SupplyDropUnlocks_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SupplyDropPlacement.B_SupplyDropPlacement_C
// 0x01A0 (0x0910 - 0x0770)
class AB_SupplyDropPlacement_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(Transient, DuplicateTransient)
	class UBoxComponent*                          ActiveFloorCollision;                              // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Reticle;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_SupplydropCrate_Explosion;                       // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SupplyDropBeep;                                    // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision;                                         // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        NewIncoming;                                       // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SupplyDrop_Mesh_Open;                              // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SupplyDrop_Mesh;                                   // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  FortMiniMap1;                                      // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FallingTimeline_FallCurve_A2643A72491D3A745741F8A24DC189B4; // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FallingTimeline__Direction_A2643A72491D3A745741F8A24DC189B4; // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FallingTimeline;                                   // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Allow_SupplyDrop_Interact;                         // 0x07E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Activate_Sound;                                    // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Impact_Sound;                                      // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Loot_Sound;                                        // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventHit;                                          // 0x0800(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0808(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DelayForSelfDestruct;                              // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LootSpawnOffset;                                   // 0x08B4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallHeight;                                        // 0x08C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSupplyDropUnlocks                     Unlocks;                                           // 0x08C4(0x0005)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LootTableNames;                                    // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FTimerHandle                           SelfDestructTimerHandle;                           // 0x08E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class ABuildingFloor*                         Floor;                                             // 0x08E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x08F0(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         FallTime;                                          // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SecondaryFallingTimerHandle;                       // 0x0900(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bLooted;                                           // 0x0908(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_B_SupplyDropPlacement(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SecondaryFallTick();
	void PlayDropNewTime();
	void SpawnLootDestroyActor();
	void StopFallingTimeline();
	void PlayDrop();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn);
	void SelfDestruction();
	void OverlappingDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BndEvt__ActiveFloorCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ImpactFX();
	void FallingTimeline__Impact__EventFunc();
	void FallingTimeline__StartTrail__EventFunc();
	void FallingTimeline__UpdateFunc();
	void FallingTimeline__FinishedFunc();
	void UserConstructionScript();
	void SpawnLoot();
	void TurnOnInteract(bool bNewActorEnableCollision);
	void UpdateLocation(float Time);
	void Landed();
	void InitDrop(const struct FSupplyDropUnlocks& InUnlocks);
	void LootSpawnPosition(struct FVector* OutPos);
	void SpawnTierDrops(int32 LootTableIndex);
	void ClientPlayDropFX();
	void ToggleFallingFX(bool bToggleOn);
	struct FVector GetImpactLocation();
	struct FVector GetFallLocation();
	void OnRep_NewLocation();
	void OnRep_bLooted();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;
	bool IsAcceptablePositionForPlacement(const struct FVector& InLocation, const struct FRotator& InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, class FText* OutFailureReason) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SupplyDropPlacement_C">();
	}
	static class AB_SupplyDropPlacement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SupplyDropPlacement_C>();
	}
};
static_assert(alignof(AB_SupplyDropPlacement_C) == 0x000010, "Wrong alignment on AB_SupplyDropPlacement_C");
static_assert(sizeof(AB_SupplyDropPlacement_C) == 0x000910, "Wrong size on AB_SupplyDropPlacement_C");
static_assert(offsetof(AB_SupplyDropPlacement_C, UberGraphFrame) == 0x000770, "Member 'AB_SupplyDropPlacement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, ActiveFloorCollision) == 0x000778, "Member 'AB_SupplyDropPlacement_C::ActiveFloorCollision' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Scene) == 0x000780, "Member 'AB_SupplyDropPlacement_C::Scene' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, P_Reticle) == 0x000788, "Member 'AB_SupplyDropPlacement_C::P_Reticle' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, P_SupplydropCrate_Explosion) == 0x000790, "Member 'AB_SupplyDropPlacement_C::P_SupplydropCrate_Explosion' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, SupplyDropBeep) == 0x000798, "Member 'AB_SupplyDropPlacement_C::SupplyDropBeep' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Collision) == 0x0007A0, "Member 'AB_SupplyDropPlacement_C::Collision' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, NewIncoming) == 0x0007A8, "Member 'AB_SupplyDropPlacement_C::NewIncoming' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, SupplyDrop_Mesh_Open) == 0x0007B0, "Member 'AB_SupplyDropPlacement_C::SupplyDrop_Mesh_Open' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Trail) == 0x0007B8, "Member 'AB_SupplyDropPlacement_C::Trail' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, SupplyDrop_Mesh) == 0x0007C0, "Member 'AB_SupplyDropPlacement_C::SupplyDrop_Mesh' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FortMiniMap1) == 0x0007C8, "Member 'AB_SupplyDropPlacement_C::FortMiniMap1' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FallingTimeline_FallCurve_A2643A72491D3A745741F8A24DC189B4) == 0x0007D0, "Member 'AB_SupplyDropPlacement_C::FallingTimeline_FallCurve_A2643A72491D3A745741F8A24DC189B4' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FallingTimeline__Direction_A2643A72491D3A745741F8A24DC189B4) == 0x0007D4, "Member 'AB_SupplyDropPlacement_C::FallingTimeline__Direction_A2643A72491D3A745741F8A24DC189B4' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FallingTimeline) == 0x0007D8, "Member 'AB_SupplyDropPlacement_C::FallingTimeline' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Allow_SupplyDrop_Interact) == 0x0007E0, "Member 'AB_SupplyDropPlacement_C::Allow_SupplyDrop_Interact' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Activate_Sound) == 0x0007E8, "Member 'AB_SupplyDropPlacement_C::Activate_Sound' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Impact_Sound) == 0x0007F0, "Member 'AB_SupplyDropPlacement_C::Impact_Sound' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Loot_Sound) == 0x0007F8, "Member 'AB_SupplyDropPlacement_C::Loot_Sound' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, EventHit) == 0x000800, "Member 'AB_SupplyDropPlacement_C::EventHit' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, EventData) == 0x000808, "Member 'AB_SupplyDropPlacement_C::EventData' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, DelayForSelfDestruct) == 0x0008B0, "Member 'AB_SupplyDropPlacement_C::DelayForSelfDestruct' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, LootSpawnOffset) == 0x0008B4, "Member 'AB_SupplyDropPlacement_C::LootSpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FallHeight) == 0x0008C0, "Member 'AB_SupplyDropPlacement_C::FallHeight' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Unlocks) == 0x0008C4, "Member 'AB_SupplyDropPlacement_C::Unlocks' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, LootTableNames) == 0x0008D0, "Member 'AB_SupplyDropPlacement_C::LootTableNames' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, SelfDestructTimerHandle) == 0x0008E0, "Member 'AB_SupplyDropPlacement_C::SelfDestructTimerHandle' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, Floor) == 0x0008E8, "Member 'AB_SupplyDropPlacement_C::Floor' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, NewLocation) == 0x0008F0, "Member 'AB_SupplyDropPlacement_C::NewLocation' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, FallTime) == 0x0008FC, "Member 'AB_SupplyDropPlacement_C::FallTime' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, SecondaryFallingTimerHandle) == 0x000900, "Member 'AB_SupplyDropPlacement_C::SecondaryFallingTimerHandle' has a wrong offset!");
static_assert(offsetof(AB_SupplyDropPlacement_C, bLooted) == 0x000908, "Member 'AB_SupplyDropPlacement_C::bLooted' has a wrong offset!");

}

