#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeBundlePage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeBundlePage.ChallengeBundlePage_C
// 0x0048 (0x0430 - 0x03E8)
class UChallengeBundlePage_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UChallengeProgressWidget_C*             ChallengeProgressWidget;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ClaimRewardsButton;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestListTitle;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           QuestPanel;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortChallengeBundleItem*               ChallengeBundleItem;                               // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeBundlePage(int32 EntryPoint);
	void Construct();
	void SetChallengeBundleItem(class UFortChallengeBundleItem* InChallengeBundleItem);
	void UpdateQuests();
	void ClaimNextQuestReward();
	void RegisterEventListeners();
	void CreateDisabledQuestWidget(class UFortQuestItemDefinition* QuestDefinition);
	void CreateQuestWidget(class UFortQuestItem* Quest);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeBundlePage_C">();
	}
	static class UChallengeBundlePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeBundlePage_C>();
	}
};
static_assert(alignof(UChallengeBundlePage_C) == 0x000008, "Wrong alignment on UChallengeBundlePage_C");
static_assert(sizeof(UChallengeBundlePage_C) == 0x000430, "Wrong size on UChallengeBundlePage_C");
static_assert(offsetof(UChallengeBundlePage_C, UberGraphFrame) == 0x0003F0, "Member 'UChallengeBundlePage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ChallengeProgressWidget) == 0x0003F8, "Member 'UChallengeBundlePage_C::ChallengeProgressWidget' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ClaimRewardsButton) == 0x000400, "Member 'UChallengeBundlePage_C::ClaimRewardsButton' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_0) == 0x000408, "Member 'UChallengeBundlePage_C::Image_0' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_1) == 0x000410, "Member 'UChallengeBundlePage_C::Image_1' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, QuestListTitle) == 0x000418, "Member 'UChallengeBundlePage_C::QuestListTitle' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, QuestPanel) == 0x000420, "Member 'UChallengeBundlePage_C::QuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ChallengeBundleItem) == 0x000428, "Member 'UChallengeBundlePage_C::ChallengeBundleItem' has a wrong offset!");

}

