#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_Survivalist

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Commando_Survivalist.GA_Commando_Survivalist_C.ExecuteUbergraph_GA_Commando_Survivalist
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00A8)(ConstParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist) == 0x000008, "Wrong alignment on GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist");
static_assert(sizeof(GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist) == 0x0000B8, "Wrong size on GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist");
static_assert(offsetof(GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist, EntryPoint) == 0x000000, "Member 'GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist, K2Node_Event_EventData) == 0x000008, "Member 'GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000B0, "Member 'GA_Commando_Survivalist_C_ExecuteUbergraph_GA_Commando_Survivalist::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function GA_Commando_Survivalist.GA_Commando_Survivalist_C.ApplyHeal
// 0x0048 (0x0048 - 0x0000)
struct GA_Commando_Survivalist_C_ApplyHeal final
{
public:
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0028(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Commando_Survivalist_C_ApplyHeal) == 0x000008, "Wrong alignment on GA_Commando_Survivalist_C_ApplyHeal");
static_assert(sizeof(GA_Commando_Survivalist_C_ApplyHeal) == 0x000048, "Wrong size on GA_Commando_Survivalist_C_ApplyHeal");
static_assert(offsetof(GA_Commando_Survivalist_C_ApplyHeal, CallFunc_FMax_ReturnValue) == 0x000000, "Member 'GA_Commando_Survivalist_C_ApplyHeal::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ApplyHeal, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Commando_Survivalist_C_ApplyHeal::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ApplyHeal, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'GA_Commando_Survivalist_C_ApplyHeal::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ApplyHeal, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000028, "Member 'GA_Commando_Survivalist_C_ApplyHeal::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_ApplyHeal, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000040, "Member 'GA_Commando_Survivalist_C_ApplyHeal::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_Commando_Survivalist.GA_Commando_Survivalist_C.SetupAbility
// 0x0020 (0x0020 - 0x0000)
struct GA_Commando_Survivalist_C_SetupAbility final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponentRef;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_Survivalist_C_SetupAbility) == 0x000008, "Wrong alignment on GA_Commando_Survivalist_C_SetupAbility");
static_assert(sizeof(GA_Commando_Survivalist_C_SetupAbility) == 0x000020, "Wrong size on GA_Commando_Survivalist_C_SetupAbility");
static_assert(offsetof(GA_Commando_Survivalist_C_SetupAbility, AbilitySystemComponentRef) == 0x000000, "Member 'GA_Commando_Survivalist_C_SetupAbility::AbilitySystemComponentRef' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000008, "Member 'GA_Commando_Survivalist_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000018, "Member 'GA_Commando_Survivalist_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Commando_Survivalist.GA_Commando_Survivalist_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData_0;                                       // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent, EventData_0) == 0x000000, "Member 'GA_Commando_Survivalist_C_K2_ActivateAbilityFromEvent::EventData_0' has a wrong offset!");

// Function GA_Commando_Survivalist.GA_Commando_Survivalist_C.K2_ShouldAbilityRespondToEvent
// 0x0120 (0x0120 - 0x0000)
struct GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0040(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute1; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue1;           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue123;                // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent) == 0x000008, "Wrong alignment on GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent) == 0x000120, "Wrong size on GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000040, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x0000E8, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000F0, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_AsFort_Pawn) == 0x000100, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000109, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GetFloatAttribute_ReturnValue) == 0x00010C, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute1) == 0x000110, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute1' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GetFloatAttribute_ReturnValue1) == 0x000114, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GetFloatAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000118, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasAnyTags_ReturnValue) == 0x000119, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_Not_PreBool_ReturnValue) == 0x00011A, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue) == 0x00011B, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue1) == 0x00011C, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue12) == 0x00011D, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue12' has a wrong offset!");
static_assert(offsetof(GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent, CallFunc_BooleanAND_ReturnValue123) == 0x00011E, "Member 'GA_Commando_Survivalist_C_K2_ShouldAbilityRespondToEvent::CallFunc_BooleanAND_ReturnValue123' has a wrong offset!");

}

