#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_Survivalist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_GenericTriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Commando_Survivalist.GA_Commando_Survivalist_C
// 0x00B0 (0x0C30 - 0x0B80)
class UGA_Commando_Survivalist_C final : public UGAT_GenericTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Commando_Survivalist_C;          // 0x0B80(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           EventActivation;                                   // 0x0B88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_SurvivalistHeal;                                // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventComplete;                                     // 0x0B98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HealMultiplier;                                    // 0x0BA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UpgradeHealMultiplier;                             // 0x0BA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_NoTimeToBleed;                                  // 0x0BA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BaseHealMultiplier;                                // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoTimeToBleed;                                     // 0x0BCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BCD[0x3];                                      // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_Abilities;                                      // 0x0BD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAttribute                     Attribute_MaxHealth;                               // 0x0BF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute_CurrentHealth;                           // 0x0C10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Commando_Survivalist(int32 EntryPoint);
	void ApplyHeal();
	void SetupAbility(class UAbilitySystemComponent* AbilitySystemComponentRef);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Commando_Survivalist_C">();
	}
	static class UGA_Commando_Survivalist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Commando_Survivalist_C>();
	}
};
static_assert(alignof(UGA_Commando_Survivalist_C) == 0x000008, "Wrong alignment on UGA_Commando_Survivalist_C");
static_assert(sizeof(UGA_Commando_Survivalist_C) == 0x000C30, "Wrong size on UGA_Commando_Survivalist_C");
static_assert(offsetof(UGA_Commando_Survivalist_C, UberGraphFrame_GA_Commando_Survivalist_C) == 0x000B80, "Member 'UGA_Commando_Survivalist_C::UberGraphFrame_GA_Commando_Survivalist_C' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, EventActivation) == 0x000B88, "Member 'UGA_Commando_Survivalist_C::EventActivation' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, GE_SurvivalistHeal) == 0x000B90, "Member 'UGA_Commando_Survivalist_C::GE_SurvivalistHeal' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, EventComplete) == 0x000B98, "Member 'UGA_Commando_Survivalist_C::EventComplete' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, HealMultiplier) == 0x000BA0, "Member 'UGA_Commando_Survivalist_C::HealMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, UpgradeHealMultiplier) == 0x000BA4, "Member 'UGA_Commando_Survivalist_C::UpgradeHealMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, TC_NoTimeToBleed) == 0x000BA8, "Member 'UGA_Commando_Survivalist_C::TC_NoTimeToBleed' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, BaseHealMultiplier) == 0x000BC8, "Member 'UGA_Commando_Survivalist_C::BaseHealMultiplier' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, NoTimeToBleed) == 0x000BCC, "Member 'UGA_Commando_Survivalist_C::NoTimeToBleed' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, TC_Abilities) == 0x000BD0, "Member 'UGA_Commando_Survivalist_C::TC_Abilities' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, Attribute_MaxHealth) == 0x000BF0, "Member 'UGA_Commando_Survivalist_C::Attribute_MaxHealth' has a wrong offset!");
static_assert(offsetof(UGA_Commando_Survivalist_C, Attribute_CurrentHealth) == 0x000C10, "Member 'UGA_Commando_Survivalist_C::Attribute_CurrentHealth' has a wrong offset!");

}

