#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Durrrables_MovementSpeed

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Durrrables_MovementSpeed.GCNL_Durrrables_MovementSpeed_C
// 0x0030 (0x0470 - 0x0440)
class AGCNL_Durrrables_MovementSpeed_C final : public AFortGameplayCueNotify_Looping
{
public:
	class FName                                   LeftFootAttachName;                                // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightFootAttachName;                               // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MovementSpeedParticleSystem;                       // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LeftFootEmitter;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RightFootEmitter;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Durrrables_MovementSpeed_C">();
	}
	static class AGCNL_Durrrables_MovementSpeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Durrrables_MovementSpeed_C>();
	}
};
static_assert(alignof(AGCNL_Durrrables_MovementSpeed_C) == 0x000010, "Wrong alignment on AGCNL_Durrrables_MovementSpeed_C");
static_assert(sizeof(AGCNL_Durrrables_MovementSpeed_C) == 0x000470, "Wrong size on AGCNL_Durrrables_MovementSpeed_C");
static_assert(offsetof(AGCNL_Durrrables_MovementSpeed_C, LeftFootAttachName) == 0x000440, "Member 'AGCNL_Durrrables_MovementSpeed_C::LeftFootAttachName' has a wrong offset!");
static_assert(offsetof(AGCNL_Durrrables_MovementSpeed_C, RightFootAttachName) == 0x000448, "Member 'AGCNL_Durrrables_MovementSpeed_C::RightFootAttachName' has a wrong offset!");
static_assert(offsetof(AGCNL_Durrrables_MovementSpeed_C, MovementSpeedParticleSystem) == 0x000450, "Member 'AGCNL_Durrrables_MovementSpeed_C::MovementSpeedParticleSystem' has a wrong offset!");
static_assert(offsetof(AGCNL_Durrrables_MovementSpeed_C, LeftFootEmitter) == 0x000458, "Member 'AGCNL_Durrrables_MovementSpeed_C::LeftFootEmitter' has a wrong offset!");
static_assert(offsetof(AGCNL_Durrrables_MovementSpeed_C, RightFootEmitter) == 0x000460, "Member 'AGCNL_Durrrables_MovementSpeed_C::RightFootEmitter' has a wrong offset!");

}

