#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyCharacterPlacementHelper

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.ExecuteUbergraph_PartyCharacterPlacementHelper
// 0x0070 (0x0070 - 0x0000)
struct PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource1;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent1;             // 0x0018(0x0020)(ConstParm, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0050(0x0020)(ConstParm, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper");
static_assert(sizeof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper) == 0x000070, "Wrong size on PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, EntryPoint) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_EventSource1) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_EventSource1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_EventFocus1) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_EventFocus1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_ClientEvent1) == 0x000018, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_ClientEvent1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_EventSource) == 0x000040, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_EventFocus) == 0x000048, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper, K2Node_HandleClientEvent_ClientEvent) == 0x000050, "Member 'PartyCharacterPlacementHelper_C_ExecuteUbergraph_PartyCharacterPlacementHelper::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.HandleClientEvent_StoreTabSelected
// 0x0030 (0x0030 - 0x0000)
struct PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected");
static_assert(sizeof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected) == 0x000030, "Wrong size on PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected, EventSource) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected::EventSource' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected, EventFocus) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected::EventFocus' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected, ClientEvent) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabSelected::ClientEvent' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.HandleClientEvent_StoreTabClosed
// 0x0030 (0x0030 - 0x0000)
struct PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed");
static_assert(sizeof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed) == 0x000030, "Wrong size on PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed, EventSource) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed::EventSource' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed, EventFocus) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed::EventFocus' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed, ClientEvent) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_HandleClientEvent_StoreTabClosed::ClientEvent' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct PartyCharacterPlacementHelper_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_UserConstructionScript) == 0x000001, "Wrong alignment on PartyCharacterPlacementHelper_C_UserConstructionScript");
static_assert(sizeof(PartyCharacterPlacementHelper_C_UserConstructionScript) == 0x000001, "Wrong size on PartyCharacterPlacementHelper_C_UserConstructionScript");
static_assert(offsetof(PartyCharacterPlacementHelper_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnLobbyPlayerHovered
// 0x0008 (0x0008 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered) == 0x000004, "Wrong alignment on PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered) == 0x000008, "Wrong size on PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered, PlayerIndex) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerHovered::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnLobbyPlayerSelected
// 0x0008 (0x0008 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected) == 0x000004, "Wrong alignment on PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected) == 0x000008, "Wrong size on PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected, PlayerIndex) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerSelected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnLobbyPlayerUnselected
// 0x0008 (0x0008 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected) == 0x000004, "Wrong alignment on PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected) == 0x000008, "Wrong size on PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected, PlayerIndex) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerUnselected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.InitializeContextEvents
// 0x0160 (0x0160 - 0x0000)
struct PartyCharacterPlacementHelper_C_InitializeContextEvents final
{
public:
	TDelegate<void(int32 Index, const struct FFortPartySuggestion& PartySuggestion)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate1;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, const struct FFortPartySuggestion& PartySuggestion)> K2Node_CreateDelegate_OutputDelegate12; // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, const struct FFortPartySuggestion& PartySuggestion)> K2Node_CreateDelegate_OutputDelegate123; // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate1234; // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12345;         // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue123;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate123456;        // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1234;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate1234567;       // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue12345;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate12345678; // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate123456789; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue123456;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue1234567;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12345678910;   // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate1234567891011; // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue12345678;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue123456789;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate123456789101112; // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue12345678910;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate12345678910111213; // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue1234567891011;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate1234567891011121314; // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue123456789101112;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_InitializeContextEvents) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_InitializeContextEvents");
static_assert(sizeof(PartyCharacterPlacementHelper_C_InitializeContextEvents) == 0x000160, "Wrong size on PartyCharacterPlacementHelper_C_InitializeContextEvents");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate1) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate12) == 0x000020, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate123) == 0x000038, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate123' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue1) == 0x000048, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate1234) == 0x000050, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate1234' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue12) == 0x000060, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate12345) == 0x000068, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate12345' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue123) == 0x000078, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue123' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate123456) == 0x000080, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate123456' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue1234) == 0x000090, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue1234' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate1234567) == 0x000098, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate1234567' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue12345) == 0x0000A8, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue12345' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate12345678) == 0x0000B0, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate12345678' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x0000C0, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate123456789) == 0x0000C8, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate123456789' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue123456) == 0x0000D8, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue123456' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue1234567) == 0x0000E0, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue1234567' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate12345678910) == 0x0000E8, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate12345678910' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate1234567891011) == 0x0000F8, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate1234567891011' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue12345678) == 0x000108, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue12345678' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue123456789) == 0x000110, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue123456789' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate123456789101112) == 0x000118, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate123456789101112' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue12345678910) == 0x000128, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue12345678910' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate12345678910111213) == 0x000130, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate12345678910111213' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue1234567891011) == 0x000140, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue1234567891011' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate1234567891011121314) == 0x000148, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate1234567891011121314' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue123456789101112) == 0x000158, "Member 'PartyCharacterPlacementHelper_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue123456789101112' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnLobbyStarted
// 0x00B8 (0x00B8 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnLobbyStarted final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable123;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxTeamSizeForSelectedTheater_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1234;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable12345;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPartySuggestion                   CallFunc_GetPartySuggestion_OutSuggestion;         // 0x0038(0x0078)()
	bool                                          CallFunc_GetPartySuggestion_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnLobbyStarted) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_OnLobbyStarted");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnLobbyStarted) == 0x0000B8, "Wrong size on PartyCharacterPlacementHelper_C_OnLobbyStarted");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable1) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable12) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable12' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable123) == 0x00000C, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable123' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_GetContext_ReturnValue1) == 0x000018, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_GetMaxTeamSizeForSelectedTheater_ReturnValue) == 0x000020, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_GetMaxTeamSizeForSelectedTheater_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable1234) == 0x000024, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable1234' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, Temp_int_Variable12345) == 0x000030, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::Temp_int_Variable12345' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, K2Node_Select_Default) == 0x000034, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_GetPartySuggestion_OutSuggestion) == 0x000038, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_GetPartySuggestion_OutSuggestion' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyStarted, CallFunc_GetPartySuggestion_ReturnValue) == 0x0000B0, "Member 'PartyCharacterPlacementHelper_C_OnLobbyStarted::CallFunc_GetPartySuggestion_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnFrontEndCameraChanged
// 0x0028 (0x0028 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetHeroPlayerPawnByIndex_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged) == 0x000028, "Wrong size on PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, NewCamera) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, OldCamera) == 0x000001, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::OldCamera' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_GetHeroPlayerPawnByIndex_ReturnValue) == 0x000018, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_GetHeroPlayerPawnByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'PartyCharacterPlacementHelper_C_OnFrontEndCameraChanged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnTeamMemberAdded
// 0x01B0 (0x01B0 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnTeamMemberAdded) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_OnTeamMemberAdded");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnTeamMemberAdded) == 0x0001B0, "Wrong size on PartyCharacterPlacementHelper_C_OnTeamMemberAdded");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberAdded, TeamMemberInfo) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberAdded::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberAdded, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberAdded::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnTeamMemberRemoved
// 0x0008 (0x0008 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnTeamMemberRemoved final
{
public:
	int32                                         TeamMemberRemovedInt;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnTeamMemberRemoved) == 0x000004, "Wrong alignment on PartyCharacterPlacementHelper_C_OnTeamMemberRemoved");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnTeamMemberRemoved) == 0x000008, "Wrong size on PartyCharacterPlacementHelper_C_OnTeamMemberRemoved");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberRemoved, TeamMemberRemovedInt) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberRemoved::TeamMemberRemovedInt' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberRemoved, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberRemoved::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnTeamMemberStateChanged
// 0x01B0 (0x01B0 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged) == 0x0001B0, "Wrong size on PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged, TeamMemberInfo) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'PartyCharacterPlacementHelper_C_OnTeamMemberStateChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.OnLobbyPlayerUnhovered
// 0x0008 (0x0008 - 0x0000)
struct PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered) == 0x000004, "Wrong alignment on PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered");
static_assert(sizeof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered) == 0x000008, "Wrong size on PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered, PlayerIndex) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered::PlayerIndex' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'PartyCharacterPlacementHelper_C_OnLobbyPlayerUnhovered::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.InitializeWidgets
// 0x0060 (0x0060 - 0x0000)
struct PartyCharacterPlacementHelper_C_InitializeWidgets final
{
public:
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadBottom_C*                K2Node_DynamicCast_AsLobby_Player_Pad_Bottom;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue1;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue12;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerAddPlayer_C*                K2Node_DynamicCast_AsLobby_Player_Add_Player;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyPlayerPadGadgets_C*               K2Node_DynamicCast_AsLobby_Player_Pad_Gadgets;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue123;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadTop_C*                   K2Node_DynamicCast_AsLobby_Player_Pad_Top;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess123;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyCharacterPlacementHelper_C_InitializeWidgets) == 0x000008, "Wrong alignment on PartyCharacterPlacementHelper_C_InitializeWidgets");
static_assert(sizeof(PartyCharacterPlacementHelper_C_InitializeWidgets) == 0x000060, "Wrong size on PartyCharacterPlacementHelper_C_InitializeWidgets");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000000, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_AsLobby_Player_Pad_Bottom) == 0x000008, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_AsLobby_Player_Pad_Bottom' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, CallFunc_GetUserWidgetObject_ReturnValue1) == 0x000018, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::CallFunc_GetUserWidgetObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, CallFunc_GetUserWidgetObject_ReturnValue12) == 0x000020, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::CallFunc_GetUserWidgetObject_ReturnValue12' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_AsLobby_Player_Add_Player) == 0x000028, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_AsLobby_Player_Add_Player' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_AsLobby_Player_Pad_Gadgets) == 0x000038, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_AsLobby_Player_Pad_Gadgets' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_bSuccess12) == 0x000040, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, CallFunc_GetUserWidgetObject_ReturnValue123) == 0x000048, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::CallFunc_GetUserWidgetObject_ReturnValue123' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_AsLobby_Player_Pad_Top) == 0x000050, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_AsLobby_Player_Pad_Top' has a wrong offset!");
static_assert(offsetof(PartyCharacterPlacementHelper_C_InitializeWidgets, K2Node_DynamicCast_bSuccess123) == 0x000058, "Member 'PartyCharacterPlacementHelper_C_InitializeWidgets::K2Node_DynamicCast_bSuccess123' has a wrong offset!");

// Function PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C.RefreshWidgets
// 0x03F8 (0x03F8 - 0x0000)
struct PartyCharacterPlacementHelper_C_RefreshWidgets final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x01A8)(Edit, BlueprintVisible)
	bool                                          Has_Player;                                        // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable123;                             // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable12;                              // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1234;                            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12345;                           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue1;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortTeamMemberInfo>            CallFunc_GetTeamMembers_TeamMembers;               // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue12;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInLobby_IsInLobby;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CompletedQuestPrerequisites_bCompleted;   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInLobby_IsInLobby1;                     // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue123;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable123456;                          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1234567;                         // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable123;                             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayersUniqueID_ReturnValue;       // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue1234;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentPartyMaxSize_ReturnValue;       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue12345;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortStoreState                               CallFunc_GetStoreState_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select12_Default;                           // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue12;                  // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    CallFunc_Array_Get_Item;                           // 0x0238(0x01A8)()
	ESlateVisibility                              K2Node_Select123_Default;                          // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue123;                // 0x03E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
