#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedirectToEpicAccount

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.ExecuteUbergraph_RedirectToEpicAccount
// 0x0018 (0x0018 - 0x0000)
struct RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bImportEnabled;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         K2Node_Event_AccountType;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount) == 0x000008, "Wrong alignment on RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount");
static_assert(sizeof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount) == 0x000018, "Wrong size on RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, EntryPoint) == 0x000000, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::EntryPoint' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, K2Node_Event_bImportEnabled) == 0x000010, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::K2Node_Event_bImportEnabled' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount, K2Node_Event_AccountType) == 0x000011, "Member 'RedirectToEpicAccount_C_ExecuteUbergraph_RedirectToEpicAccount::K2Node_Event_AccountType' has a wrong offset!");

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RedirectToEpicAccount_C_BndEvt__Button_NewAccount_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RedirectToEpicAccount.RedirectToEpicAccount_C.UpdateNewAccountText
// 0x0002 (0x0002 - 0x0000)
struct RedirectToEpicAccount_C_UpdateNewAccountText final
{
public:
	bool                                          bImportEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         AccountType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RedirectToEpicAccount_C_UpdateNewAccountText) == 0x000001, "Wrong alignment on RedirectToEpicAccount_C_UpdateNewAccountText");
static_assert(sizeof(RedirectToEpicAccount_C_UpdateNewAccountText) == 0x000002, "Wrong size on RedirectToEpicAccount_C_UpdateNewAccountText");
static_assert(offsetof(RedirectToEpicAccount_C_UpdateNewAccountText, bImportEnabled) == 0x000000, "Member 'RedirectToEpicAccount_C_UpdateNewAccountText::bImportEnabled' has a wrong offset!");
static_assert(offsetof(RedirectToEpicAccount_C_UpdateNewAccountText, AccountType) == 0x000001, "Member 'RedirectToEpicAccount_C_UpdateNewAccountText::AccountType' has a wrong offset!");

}

