#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialImportPanel

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SocialImportPanel.SocialImportPanel_C.ExecuteUbergraph_SocialImportPanel
// 0x0018 (0x0018 - 0x0000)
struct SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelType                        Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelType                        K2Node_Event_NewType;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel) == 0x000004, "Wrong alignment on SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel");
static_assert(sizeof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel) == 0x000018, "Wrong size on SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, EntryPoint) == 0x000000, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, Temp_byte_Variable) == 0x000004, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, Temp_int_Variable) == 0x000008, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, Temp_int_Variable1) == 0x00000C, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, K2Node_Event_NewType) == 0x000010, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::K2Node_Event_NewType' has a wrong offset!");
static_assert(offsetof(SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel, K2Node_Select_Default) == 0x000014, "Member 'SocialImportPanel_C_ExecuteUbergraph_SocialImportPanel::K2Node_Select_Default' has a wrong offset!");

// Function SocialImportPanel.SocialImportPanel_C.OnPanelTypeSet
// 0x0001 (0x0001 - 0x0000)
struct SocialImportPanel_C_OnPanelTypeSet final
{
public:
	ESocialImportPanelType                        NewType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialImportPanel_C_OnPanelTypeSet) == 0x000001, "Wrong alignment on SocialImportPanel_C_OnPanelTypeSet");
static_assert(sizeof(SocialImportPanel_C_OnPanelTypeSet) == 0x000001, "Wrong size on SocialImportPanel_C_OnPanelTypeSet");
static_assert(offsetof(SocialImportPanel_C_OnPanelTypeSet, NewType) == 0x000000, "Member 'SocialImportPanel_C_OnPanelTypeSet::NewType' has a wrong offset!");

}

