#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialImportButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialImportButton.SocialImportButton_C
// 0x0040 (0x07F0 - 0x07B0)
class USocialImportButton_C final : public UFortSocialImportButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OverrideText;                                      // 0x07D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SocialImportButton(int32 EntryPoint);
	void OnCaptionGenerated(const class FText& Caption);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialImportButton_C">();
	}
	static class USocialImportButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialImportButton_C>();
	}
};
static_assert(alignof(USocialImportButton_C) == 0x000008, "Wrong alignment on USocialImportButton_C");
static_assert(sizeof(USocialImportButton_C) == 0x0007F0, "Wrong size on USocialImportButton_C");
static_assert(offsetof(USocialImportButton_C, UberGraphFrame) == 0x0007B0, "Member 'USocialImportButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, CenterButtonTextWidget) == 0x0007B8, "Member 'USocialImportButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, ContentBorder) == 0x0007C0, "Member 'USocialImportButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, LeftSideImage) == 0x0007C8, "Member 'USocialImportButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, RightExtraContentSlot) == 0x0007D0, "Member 'USocialImportButton_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, OverrideText) == 0x0007D8, "Member 'USocialImportButton_C::OverrideText' has a wrong offset!");

}

