#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAudioOptions

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function TabAudioOptions.TabAudioOptions_C.ExecuteUbergraph_TabAudioOptions
// 0x0068 (0x0068 - 0x0000)
struct TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value123;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value12;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index12345;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index1234;     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index123;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index12;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue123;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions) == 0x000008, "Wrong alignment on TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions");
static_assert(sizeof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions) == 0x000068, "Wrong size on TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, EntryPoint) == 0x000000, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value123) == 0x000004, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value12) == 0x000008, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value1) == 0x00000C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Slider_Value) == 0x000010, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Slider_Value' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index12345) == 0x000014, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index12345' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue) == 0x000018, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index1234) == 0x00001C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index123) == 0x000020, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000024, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index12) == 0x000028, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue12) == 0x00002C, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index1) == 0x000030, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_IntToBool_ReturnValue123) == 0x000034, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_IntToBool_ReturnValue123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, K2Node_ComponentBoundEvent_Selected_Index) == 0x000038, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::K2Node_ComponentBoundEvent_Selected_Index' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Array_Get_Item) == 0x000040, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'TabAudioOptions_C_ExecuteUbergraph_TabAudioOptions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChatDevice_K2Node_ComponentBoundEvent_175_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChat3DEnable_K2Node_ComponentBoundEvent_22_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChatPushToTalk_K2Node_ComponentBoundEvent_36_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__VoiceChatEnable_K2Node_ComponentBoundEvent_18_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__Quality_K2Node_ComponentBoundEvent_43_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__Subtitles_K2Node_ComponentBoundEvent_45_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__ChatVolume_K2Node_ComponentBoundEvent_15_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__DialogVolume_K2Node_ComponentBoundEvent_11_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__MusicVolume_K2Node_ComponentBoundEvent_2_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(sizeof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(offsetof(TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabAudioOptions_C_BndEvt__SoundFXVolume_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.Update Data
// 0x0158 (0x0158 - 0x0000)
struct TabAudioOptions_C_Update_Data final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable12;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable123;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable12;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1234;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable12345;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0040(0x0018)()
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindVoiceChatDeviceIndex_FoundDeviceIndex; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVoiceChat3DEnabled_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVoiceChatPTTEnabled_ReturnValue;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1_Default;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVoiceChatEnabled_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select12_Default;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuality_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12;            // 0x0078(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue123;           // 0x0090(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1234;          // 0x00A8(0x0018)()
	bool                                          Temp_bool_Variable123;                             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSubtitlesEnabled_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select123_Default;                          // 0x00C8(0x0018)()
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChatVolumeValue_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDialogVolumeValue_ReturnValue;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundFXVolumeValue_ReturnValue;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMusicVolumeValue_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12345;         // 0x00F8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue123456;        // 0x0110(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1234567;       // 0x0128(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12345678;      // 0x0140(0x0018)()
};
static_assert(alignof(TabAudioOptions_C_Update_Data) == 0x000008, "Wrong alignment on TabAudioOptions_C_Update_Data");
static_assert(sizeof(TabAudioOptions_C_Update_Data) == 0x000158, "Wrong size on TabAudioOptions_C_Update_Data");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable) == 0x000000, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable) == 0x000004, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable1) == 0x000008, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable1) == 0x00000C, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable12) == 0x000010, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable123) == 0x000014, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable12) == 0x000018, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable1234) == 0x00001C, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_int_Variable12345) == 0x000020, "Member 'TabAudioOptions_C_Update_Data::Temp_int_Variable12345' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue1) == 0x000040, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_IsConsolePlatform_ReturnValue) == 0x000058, "Member 'TabAudioOptions_C_Update_Data::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_FindVoiceChatDeviceIndex_FoundDeviceIndex) == 0x00005C, "Member 'TabAudioOptions_C_Update_Data::CallFunc_FindVoiceChatDeviceIndex_FoundDeviceIndex' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetVoiceChat3DEnabled_ReturnValue) == 0x000060, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetVoiceChat3DEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetVoiceChatPTTEnabled_ReturnValue) == 0x000061, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetVoiceChatPTTEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select_Default) == 0x000064, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select1_Default) == 0x000068, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetVoiceChatEnabled_ReturnValue) == 0x00006C, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetVoiceChatEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select12_Default) == 0x000070, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select12_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetQuality_ReturnValue) == 0x000074, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue12) == 0x000078, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue123) == 0x000090, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue1234) == 0x0000A8, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, Temp_bool_Variable123) == 0x0000C0, "Member 'TabAudioOptions_C_Update_Data::Temp_bool_Variable123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetSubtitlesEnabled_ReturnValue) == 0x0000C1, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetSubtitlesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, K2Node_Select123_Default) == 0x0000C8, "Member 'TabAudioOptions_C_Update_Data::K2Node_Select123_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000E0, "Member 'TabAudioOptions_C_Update_Data::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetChatVolumeValue_ReturnValue) == 0x0000E4, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetChatVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetDialogVolumeValue_ReturnValue) == 0x0000E8, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetDialogVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetSoundFXVolumeValue_ReturnValue) == 0x0000EC, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetSoundFXVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_GetMusicVolumeValue_ReturnValue) == 0x0000F0, "Member 'TabAudioOptions_C_Update_Data::CallFunc_GetMusicVolumeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue12345) == 0x0000F8, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue12345' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue123456) == 0x000110, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue123456' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue1234567) == 0x000128, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue1234567' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_Update_Data, CallFunc_MakeLiteralText_ReturnValue12345678) == 0x000140, "Member 'TabAudioOptions_C_Update_Data::CallFunc_MakeLiteralText_ReturnValue12345678' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.InitializeData
// 0x0178 (0x0178 - 0x0000)
struct TabAudioOptions_C_InitializeData final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0018(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12;            // 0x0040(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue123;           // 0x0058(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array1;                           // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1234;          // 0x0080(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12345;         // 0x0098(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array12;                          // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue123456;        // 0x00C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1234567;       // 0x00D8(0x0018)()
	bool                                          CallFunc_ShowChatVolume_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowQuality_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12345678;      // 0x00F8(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array123;                         // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue123456789;     // 0x0120(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue12345678910;   // 0x0138(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array1234;                        // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1234567891011; // 0x0160(0x0018)()
};
static_assert(alignof(TabAudioOptions_C_InitializeData) == 0x000008, "Wrong alignment on TabAudioOptions_C_InitializeData");
static_assert(sizeof(TabAudioOptions_C_InitializeData) == 0x000178, "Wrong size on TabAudioOptions_C_InitializeData");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue1) == 0x000018, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, K2Node_MakeArray_Array) == 0x000030, "Member 'TabAudioOptions_C_InitializeData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue12) == 0x000040, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue123) == 0x000058, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, K2Node_MakeArray_Array1) == 0x000070, "Member 'TabAudioOptions_C_InitializeData::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue1234) == 0x000080, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue12345) == 0x000098, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue12345' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, K2Node_MakeArray_Array12) == 0x0000B0, "Member 'TabAudioOptions_C_InitializeData::K2Node_MakeArray_Array12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue123456) == 0x0000C0, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue123456' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue1234567) == 0x0000D8, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue1234567' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_ShowChatVolume_ReturnValue) == 0x0000F0, "Member 'TabAudioOptions_C_InitializeData::CallFunc_ShowChatVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_ShowQuality_ReturnValue) == 0x0000F1, "Member 'TabAudioOptions_C_InitializeData::CallFunc_ShowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue12345678) == 0x0000F8, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue12345678' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, K2Node_MakeArray_Array123) == 0x000110, "Member 'TabAudioOptions_C_InitializeData::K2Node_MakeArray_Array123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue123456789) == 0x000120, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue123456789' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue12345678910) == 0x000138, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue12345678910' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, K2Node_MakeArray_Array1234) == 0x000150, "Member 'TabAudioOptions_C_InitializeData::K2Node_MakeArray_Array1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_InitializeData, CallFunc_MakeLiteralText_ReturnValue1234567891011) == 0x000160, "Member 'TabAudioOptions_C_InitializeData::CallFunc_MakeLiteralText_ReturnValue1234567891011' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.UpdateVoiceOptionsVisibility
// 0x0028 (0x0028 - 0x0000)
struct TabAudioOptions_C_UpdateVoiceOptionsVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable123;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1234;                            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12345;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      Temp_byte_Variable123456;                          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue1;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_UpdateVoiceOptionsVisibility) == 0x000008, "Wrong alignment on TabAudioOptions_C_UpdateVoiceOptionsVisibility");
static_assert(sizeof(TabAudioOptions_C_UpdateVoiceOptionsVisibility) == 0x000028, "Wrong size on TabAudioOptions_C_UpdateVoiceOptionsVisibility");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable) == 0x000000, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable1) == 0x000001, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable12) == 0x000002, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_GetSubGame_ReturnValue) == 0x000010, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_bool_Variable) == 0x000011, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable123) == 0x000013, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable123' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable1234) == 0x000014, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable1234' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable12345) == 0x000015, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable12345' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, Temp_byte_Variable123456) == 0x000016, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::Temp_byte_Variable123456' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_GetContext_ReturnValue1) == 0x000018, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_IsPS4Platform_ReturnValue) == 0x000020, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_GetSubGame_ReturnValue1) == 0x000021, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_GetSubGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_IsXboxPlatform_ReturnValue) == 0x000022, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, K2Node_Select_Default) == 0x000024, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, CallFunc_BooleanOR_ReturnValue1) == 0x000025, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_UpdateVoiceOptionsVisibility, K2Node_Select1_Default) == 0x000026, "Member 'TabAudioOptions_C_UpdateVoiceOptionsVisibility::K2Node_Select1_Default' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.GatherVoiceChatDevices
// 0x0070 (0x0070 - 0x0000)
struct TabAudioOptions_C_GatherVoiceChatDevices final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetAvailableVoiceChatInputDevices_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAudioOptions_C_GatherVoiceChatDevices) == 0x000008, "Wrong alignment on TabAudioOptions_C_GatherVoiceChatDevices");
static_assert(sizeof(TabAudioOptions_C_GatherVoiceChatDevices) == 0x000070, "Wrong size on TabAudioOptions_C_GatherVoiceChatDevices");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, Temp_text_Variable) == 0x000000, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_GetAvailableVoiceChatInputDevices_ReturnValue) == 0x000028, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_GetAvailableVoiceChatInputDevices_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Array_Get_Item) == 0x000038, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_GatherVoiceChatDevices, CallFunc_Array_Add_ReturnValue1) == 0x00006C, "Member 'TabAudioOptions_C_GatherVoiceChatDevices::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");

// Function TabAudioOptions.TabAudioOptions_C.FindVoiceChatDeviceIndex
// 0x0058 (0x0058 - 0x0000)
struct TabAudioOptions_C_FindVoiceChatDeviceIndex final
{
public:
	int32                                         FoundDeviceIndex;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVoiceChatInputDevice_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabAudioOptions_C_FindVoiceChatDeviceIndex) == 0x000008, "Wrong alignment on TabAudioOptions_C_FindVoiceChatDeviceIndex");
static_assert(sizeof(TabAudioOptions_C_FindVoiceChatDeviceIndex) == 0x000058, "Wrong size on TabAudioOptions_C_FindVoiceChatDeviceIndex");
static_assert(offsetof(TabAudioOptions_C_FindVoiceChatDeviceIndex, FoundDeviceIndex) == 0x000000, "Member 'TabAudioOptions_C_FindVoiceChatDeviceIndex::FoundDeviceIndex' has a wrong offset!");
static_assert(offsetof(TabAudioOptions_C_FindVoiceChatDeviceIndex, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TabAudioOptions_C_FindVoiceChatDeviceIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
